{
  "indextag": "Le Hadith du Prophète Muhammad (صلى الله عليه و سلم) à portée de main",
  "Collections of Forty": {
    "english_name": "Collections de Quarante",
    "arabic_name": "الأربعينات",
    "link": "https://sunnah.com/forty",
    "books_or_chapters": {
      "about_info": {
          "about_title": "Les Quarante Hadiths",
          "about_content_engish":"",
          "about_content_arabic":""
      },
      "books": [
        {
          "book_number": "",
          "english_book_name": "Quarante Hadith d'an-Nawawi",
          "arabic_book_name": "الأربعون النووية",
          "book_range": "1 to 42",
          "link": "https://sunnah.com/nawawi40",
          "chapters_and_hadiths": [
            {
              "chapter_no": null,
              "chapter_title_english": "Hadiths orphelins",
              "chapter_title_arabic": null,
              "hadiths": [
                {
                  "reference": "Hadith 1, 40 Hadith an-Nawawi",
                  "narrator": "Il est rapporté d'après l'émir des Mouminins, Abu Hafs 'Umar ibn al-Khattab (ra) qui a dit :",
                  "english_text": "J'ai entendu le Messager d'Allah (ﷺ) dire : « Les actes sont jugés selon les motifs (niyyah), ainsi chacun aura ce qu'il a voulu. Ainsi, celui dont l'émigration (hijrah) est pour Allah et Son Messager, son émigration est pour Allah et Son Messager ; mais celui dont l'émigration est pour un bien de ce monde qu'il pourrait acquérir ou pour une femme qu'il pourrait épouser, son émigration est pour ce pour quoi il a émigré. »\n\n[Boukhari et Muslim]",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 1, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 2, 40 Hadith an-Nawawi",
                  "narrator": "Également d'après 'Umar (ra) qui a dit :",
                  "english_text": "Alors que nous étions assis un jour avec le Messager d'Allah (ﷺ), apparut devant nous un homme vêtu de vêtements blancs et aux cheveux très noirs. Il n'y avait aucune trace de voyage sur lui et aucun de nous ne le connaissait. \n\nIl s'assit près du Prophète (ﷺ), posa ses genoux contre les genoux du Prophète (ﷺ) et plaça ses mains sur ses cuisses, et dit : « Ô Muhammad ! Informe-moi de l'Islam. » Le Messager d'Allah (ﷺ) répondit : « L'Islam consiste à témoigner qu'il n'y a pas de divinité digne d'adoration en dehors d'Allah et que Muhammad est Son Messager (ﷺ), à accomplir la prière rituelle, à payer la zakat, à jeûner pendant le Ramadan et à accomplir le Hajj (pèlerinage) à la Maison (la Ka`ba à La Mecque), si vous pouvez trouver un chemin pour y arriver (ou trouver les moyens d'y parvenir). » Il dit : « Tu as dit la vérité. »\n\nNous fûmes étonnés qu'il l'interrogeât ainsi (ﷺ) et lui dît ensuite qu'il avait raison. Mais il continua : « Informe-moi de la foi. » Il (le Prophète) répondit : « C'est que tu croies en Allah, en Ses anges, en Ses Livres, en Ses messagers, au Jour dernier et au destin (qadar), dans ses bons comme dans ses mauvais côtés. » Il dit : « Tu as dit vrai. »\n\nIl (l'homme) dit alors : « Informe-moi de l'Ihsan. » Il (le Prophète) répondit : « C'est que tu adores Allah comme si tu Le voyais, car bien que tu ne Le voies pas, Lui te voit. »\n\nIl dit : « Informe-moi de l'Heure. » Il (le Prophète) dit : « Celui à qui on pose la question n'en sait pas plus que celui qui pose la question. » Alors il dit : « Informe-moi de ses signes. » Il dit : « Il y a des choses que l'esclave donnera naissance à sa maîtresse et que vous verrez les déchaussés, les nus, les démunis, les bergers de moutons (concurrencer les uns avec les autres) pour construire de hautes constructions. » L'homme s'en alla.\n\nJ'attendis un moment, puis il (le Prophète) dit : « Ô 'Umar, sais-tu qui était cet interrogateur ? » Je répondis : « Allah et Son Messager le savent mieux. » Il dit : « C'était Jibril. Il est venu vous enseigner votre religion. »\n\n[Muslim]",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 2, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 3, 40 Hadith an-Nawawi",
                  "narrator": "D'après Abdullah, fils d'Omar ibn al-Khattab (ra), qui a dit :",
                  "english_text": "J'ai entendu le Messager d'Allah (ﷺ) dire : « L'Islam est fondé sur cinq piliers : témoigner qu'il n'y a pas de divinité digne d'adoration en dehors d'Allah et que Muhammad est le Messager d'Allah, accomplir la prière, s'acquitter de la zakat (aumône obligatoire), accomplir le pèlerinage à la Maison et jeûner pendant le Ramadan. »\n\n[Bukhari & Muslim]",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 3, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 4, 40 Hadith an-Nawawi",
                  "narrator": "D'après Abdullah ibn Masood (ra), qui a dit :",
                  "english_text": "FrançaisLe Messager d'Allah (ﷺ), qui est le véridique, le croyant, nous a rapporté : « En vérité, chacun de vous est créé dans le ventre de sa mère pendant quarante jours sous la forme d'une goutte, puis il devient un caillot de sang pendant une période similaire, puis un morceau de chair pendant une période similaire, puis il lui est envoyé un ange qui lui insuffle son âme et qui reçoit quatre ordres : d'écrire sa subsistance, sa durée de vie, ses actions et s'il sera heureux ou malheureux (c'est-à-dire s'il entrera ou non au Paradis). \n\nPar Celui qu'il n'y a pas d'autre divinité que Lui, en vérité l'un de vous accomplit les actions des gens du Paradis jusqu'à ce qu'il n'y ait plus qu'une longueur de bras entre lui et le Paradis, et ce qui a été écrit le rattrape, alors il agit avec les actions des gens de l'Enfer et y entre ainsi ; et en vérité, l’un d’entre vous accomplit les actions des gens de l’Enfer, jusqu’à ce qu’il ne reste plus qu’une longueur de bras entre lui et l’Enfer, et ce qui a été écrit le rattrape, et il agit alors avec les actions des gens du Paradis et ainsi il y entre. »\n\n[Bukhari & Muslim]",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 4, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 5, 40 Hadith an-Nawawi",
                  "narrator": "D'après la mère des croyants, Aïcha (ra), qui a dit :",
                  "english_text": "Le Messager d’Allah (ﷺ) a dit : « Quiconque innove en cette matière (c’est-à-dire en Islam) en quoi que ce soit qui n’en fait pas partie, la verra rejetée (par Allah). »\n\n[Boukhari et Muslim]\nDans une autre version de Muslim, on peut lire : « Quiconque fait un acte que nous n’avons pas ordonné, la verra rejetée (par Allah). »",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 5, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 6, 40 Hadith an-Nawawi",
                  "narrator": "D’après an-Nu’man ibn Basheer (ra), qui a dit :",
                  "english_text": "J’ai entendu le Messager d’Allah (ﷺ) dire : « Ce qui est licite est clair et ce qui est illicite est clair. Entre les deux, il y a des choses douteuses que beaucoup de gens ignorent. Ainsi, celui qui évite les choses douteuses se rassure quant à sa religion et à son honneur, mais celui qui tombe dans les choses douteuses tombe dans l’illicite, comme le berger qui paît autour d’un sanctuaire, ne faisant que paître. En vérité, chaque roi a un sanctuaire, et le sanctuaire d’Allah, ce sont Ses interdits. En vérité, il y a dans le corps un morceau de chair qui, s’il est entier, tout le corps l’est, et s’il est malade, tout [le corps] l’est. En vérité, c’est le cœur. »\n\n[Boukhari & Muslim]",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 6, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 7, 40 Hadith an-Nawawi",
                  "narrator": "D'après Tameem ibn Aus ad-Dari (ra) :",
                  "english_text": "Le Prophète (ﷺ) a dit : « La religion est une recommandation. » Nous avons demandé : « À qui ? » Il (ﷺ) a dit : « À Allah, à Son Livre, à Son Messager, aux chefs des musulmans et à leur peuple. »\n\n[Muslim]",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 7, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 8, 40 Hadith an-Nawawi",
                  "narrator": "D'après Abdullah ibn Umar (ra) :",
                  "english_text": "Le Messager d'Allah (ﷺ) a dit : « J'ai reçu l'ordre de combattre les gens jusqu'à ce qu'ils attestent qu'il n'y a pas d'autre divinité digne d'adoration qu'Allah et que Muhammad est le Messager d'Allah, qu'ils accomplissent la prière et s'acquittent de la zakat. S'ils le font, ils seront alors protégés par moi pour leurs vies et leurs biens, à moins qu'ils ne commettent des actes punissables en Islam. Et leur compte sera à Allah. »\n\n[Boukhari & Muslim]",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 8, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 9, 40 Hadith an-Nawawi",
                  "narrator": "D'après Abou Hourayra (ra) :",
                  "english_text": "J'ai entendu le Messager d'Allah (ﷺ) dire : « Ce que je vous ai interdit, évitez-le. Ce que je vous ai ordonné, faites-le autant que vous le pouvez. En vérité, ce ne sont que leurs interrogations excessives et leurs désaccords avec leurs prophètes qui ont détruit [les nations] qui étaient avant vous. »\n\n[Boukhari et Muslim]",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 9, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 10, 40 Hadith an-Nawawi",
                  "narrator": "D'après Abou Hourayra (ra) :",
                  "english_text": "Le Messager d’Allah (ﷺ) a dit : « Allah, le Tout-Puissant, est bon et n’accepte que ce qui est bon. Et Allah a en vérité ordonné aux croyants de faire ce qu’Il ​​a ordonné aux Messagers. \n\nAlors le Tout-Puissant a dit : « Ô Messagers ! Mangez des aliments licites et accomplissez de bonnes œuvres. » [23:51] Et le Tout-Puissant a dit : « Ô vous qui croyez ! Mangez des aliments licites que Nous vous avons attribués. » [2:172] »\n\nPuis il a mentionné [le cas] d’un homme qui, après avoir voyagé loin, est échevelé et couvert de poussière, et qui étend ses mains vers le ciel en disant : « Ô Seigneur ! Ô Seigneur ! », alors que sa nourriture est haram (illicite), sa boisson est haram, son vêtement est haram et il a été nourri de haram. Comment alors [sa supplication] peut-elle être exaucée ? \n\n[Musulman]",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 10, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 11, 40 Hadith an-Nawawi",
                  "narrator": "D'après Abou Muhammad al-Hasan ibn Ali ibn Abi Talib (qu'Allah l'agrée), le petit-fils du Messager d'Allah (bénédiction et salut soient sur lui) et celui qu'il aimait le plus, qui a dit :",
                  "english_text": "J'ai mémorisé le hadith du Messager d'Allah (sur lui la paix et le salut) : « Laissez ce qui vous fait douter pour ce qui ne vous fait pas douter. »\n\n[At-Tirmidhi]\n[An-Nasai]\nAt-Tirmidhi a dit que c'était un hadith bon et authentique (hasan sahih).",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 11, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 12, 40 Hadith an-Nawawi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée) qui a dit :",
                  "english_text": "Le Messager d’Allah (sur lui la paix et le salut) a dit : « La perfection de l’Islam consiste en partie à abandonner ce qui ne le concerne pas. »\n\nUn hadith hasan (bon) qui a été rapporté de cette façon par at-Tirmidhi et d’autres.",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 12, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 13, 40 Hadith an-Nawawi",
                  "narrator": "D'après Abou Hamzah Anas ibn Malik (qu'Allah l'agrée), serviteur du Messager d'Allah (sur lui la paix et le salut), le Prophète (sur lui la paix et le salut) a dit :",
                  "english_text": "Aucun d'entre vous ne croit [vraiment] tant qu'il n'aime pas pour son frère ce qu'il aime pour lui-même. \n\n[Al-Bukhari]\n[Muslim]",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 13, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 14, 40 Hadith an-Nawawi",
                  "narrator": "D'après Ibn Masood (qu'Allah l'agrée) qui a dit :",
                  "english_text": "Le Messager d’Allah (sur lui la paix et le salut) a dit : « Il n’est pas permis de verser le sang d’un musulman sauf dans trois cas : celui d’un homme marié qui commet l’adultère, celui d’une vie pour une vie et celui qui abandonne sa religion et se sépare de la communauté. »\n\n[Al-Bukhari]\n[Muslim]",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 14, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 15, 40 Hadith an-Nawawi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), le Messager d'Allah (sur lui la paix et le salut) a dit :",
                  "english_text": "Que celui qui croit en Allah et au Jour dernier dise du bien ou se taise ; que celui qui croit en Allah et au Jour dernier soit généreux envers son prochain ; et que celui qui croit en Allah et au Jour dernier soit généreux envers son invité.\n\n[Al-Bukhari]\n[Muslim]",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 15, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 16, 40 Hadith an-Nawawi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée) :",
                  "english_text": "Un homme dit au Prophète (sur lui la paix et le salut) : « Donne-moi un conseil », ce à quoi il répondit : « Ne te mets pas en colère ». L’homme répéta plusieurs fois sa demande de conseil et il répondit à chaque fois : « Ne te mets pas en colère ».\n\n[Al-Bukhari]",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 16, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 17, 40 Hadith an-Nawawi",
                  "narrator": "D’après Abou Ya’la Shaddad ibn Aws (qu’Allah l’agrée), le Messager d’Allah (sur lui la paix et le salut) a dit :",
                  "english_text": "En vérité, Allah a prescrit la perfection en toute chose. Si vous tuez, tuez bien ; et si vous égorgez, égorgez bien. Que chacun de vous aiguise sa lame et qu'il épargne la souffrance à l'animal qu'il égorge. »\n\n[Muslim]",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 17, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 18, 40 Hadith an-Nawawi",
                  "narrator": "D'après Abou Dharr Jundub ibn Junadah et Abou Abdur-Rahman Muadh bin Jabal (qu'Allah l'agrée), le Messager d'Allah (bénédiction et salut soient sur lui) a dit :",
                  "english_text": "Ayez la crainte d'Allah où que vous soyez, faites suivre chaque mauvaise action d'une bonne action qui l'effacera, et comportez-vous bien envers les gens.\n\nAt-Tirmidhi a rapporté ce hadith comme étant un bon hadith, et certaines versions le considèrent comme un hadith authentique et bon.",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 18, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 19, 40 Hadith an-Nawawi",
                  "narrator": "D'après Abu Abbas Abdullah bin Abbas (qu'Allah l'agrée) qui a dit :",
                  "english_text": "Un jour, j’étais derrière le Prophète (sur lui la même monture) et il me dit : « Ô jeune homme, je vais t’enseigner quelques paroles [de conseil] : Sois attentif à Allah et Allah te protégera. Sois attentif à Allah et tu Le trouveras devant toi. Si tu demandes, alors demande à Allah [seul] ; et si tu cherches de l’aide, alors cherche de l’aide auprès d’Allah [seul]. Et sache que si la communauté se rassemble pour te faire du bien, elle ne te fera du bien que dans la mesure où Allah t’a déjà prescrit. Et si elle se rassemble pour te faire du mal, elle ne te fera du mal que dans la mesure où Allah t’a déjà prescrit. Les plumes sont levées et les pages sont sèches. »\n\nCe hadith a été rapporté par at-Tirmidhi, qui a dit qu’il s’agissait d’un bon et vrai hadith. Une autre narration, autre que celle de Tirmidhi, dit :\n\nSoyez attentif à Allah et vous Le trouverez devant vous. Reconnaissez Allah dans l'aisance et dans la prospérité, et Il se souviendra de vous dans l'adversité. Et sachez que ce qui vous a échappé ne vous échappera pas, et que ce qui vous a atteint ne vous échappera pas. Et sachez que la victoire vient avec la patience, le soulagement avec l'affliction, et la difficulté avec l'aisance.",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 19, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 20, 40 Hadith an-Nawawi",
                  "narrator": "D’après Abu Masood Uqbah bin ’Amr al-Ansari al-Badrî (qu’Allah l’agrée) qui a dit :",
                  "english_text": "Le Messager d’Allah (sur lui la paix et le salut) a dit : « En vérité, ce que les gens ont appris de la première prophétie est : Si vous n’éprouvez aucune honte, faites ce que vous voulez. »\n\n[Al-Bukhari]",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 20, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 21, 40 Hadith an-Nawawi",
                  "narrator": "D'après Abu `Amr — également appelé Abu `Amrah — Sufyan bin Abdullah ath- Thaqafee (qu'Allah l'agrée) qui a dit :",
                  "english_text": "Je dis : « Ô Messager d'Allah, dis-moi quelque chose sur l'Islam que je ne puisse demander à personne d'autre que toi. » Il (que la paix et les bénédictions d'Allah soient sur lui) dit : « Dis-moi que tu crois en Allah, et ensuite sois ferme. »\n\n[Muslim]",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 21, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 22, 40 Hadith an-Nawawi",
                  "narrator": "D'après Abu Abdullah Jabir bin Abdullah al-Ansari (qu'Allah l'agrée) :",
                  "english_text": "Un homme a interrogé le Messager d’Allah (sur lui la paix et le salut) et lui a dit : « Penses-tu que si j’accomplissais les prières obligatoires, je jeûnais le Ramadan, considérais comme licite ce qui est licite et interdisais ce qui est illicite, et n’augmentais pas ces actes [en actes surérogatoires], j’entrerais au Paradis ? » Il (sur lui la paix et le salut) a répondu : « Oui. »\n\n[Muslim]",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 22, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 23, 40 Hadith an-Nawawi",
                  "narrator": "D'après Abou Malik al-Harith ibn Asim al-Asharei (qu'Allah l'agrée) qui a dit :",
                  "english_text": "Le Messager d’Allah (sur lui la paix et le salut) a dit : « La pureté est la moitié de la foi. La louange à Allah remplit la balance, et la louange à Allah et la prière remplissent ce qui est entre le ciel et la terre. La prière est une lumière, l’aumône une preuve, la patience une illumination, et le Coran une preuve pour vous ou contre vous. Chaque personne commence sa journée en vendant son âme, soit en la libérant, soit en la détruisant. »\n\n[Muslim]",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 23, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 24, 40 Hadith an-Nawawi",
                  "narrator": "D'après Abou Dharr al-Ghifarî (qu'Allah l'agrée), le Prophète (bénédiction et salut soient sur lui) a dit, d'après son Seigneur :",
                  "english_text": "Ô Mes serviteurs ! Je me suis interdit l'oppression (dhulm) et je l'ai interdite entre vous. Ne vous opprimez donc pas les uns les autres.\n\nÔ Mes serviteurs, vous êtes tous dans l'égarement, sauf ceux que J'ai guidés. Cherchez donc auprès de Moi un guide et Je vous guiderai.\n\nÔ Mes serviteurs, vous avez tous faim, sauf ceux que J'ai nourris. Cherchez donc auprès de Moi un aliment et Je vous nourrirai.\n\nÔ Mes serviteurs, vous êtes tous nus, sauf ceux que J'ai habillés. Cherchez donc auprès de Moi un vêtement et Je vous habillerai.\n\nÔ Mes serviteurs, vous commettez des péchés jour et nuit, et Je pardonne tous les péchés. Cherchez donc auprès de Moi un pardon et Je vous pardonnerai.\n\nÔ Mes serviteurs, vous ne parviendrez pas à Me nuire pour Me nuire, et vous ne parviendrez pas à Me faire du bien pour Me faire du bien.\n\nÔ Mes serviteurs, si le premier d'entre vous et le dernier d'entre vous, les humains et les djinns parmi vous, étaient tous aussi pieux que le cœur le plus pieux de n'importe lequel d'entre vous, alors cela n'augmenterait pas d'un iota Mon Royaume.\n\nÔ Mes serviteurs, si le premier d'entre vous et le dernier d'entre vous, les humains et les djinns parmi vous, étaient tous aussi méchants que le cœur le plus méchant de n'importe lequel d'entre vous, alors cela ne diminuerait pas d'un iota Mon Royaume.\n\nÔ Mes serviteurs, si le premier d'entre vous et le dernier d'entre vous, les humains et les djinns parmi vous, se réunissaient tous en un seul endroit et Me demandaient, et que Je donnais à chacun ce qu'il demandait, alors cela ne diminuerait pas ce que Je Possède, sauf ce que diminue l'océan quand une aiguille y est plongée.\n\nÔ Mes serviteurs, ce ne sont que vos actes dont Je vous rends compte, et pour lesquels Je vous rétribue. Ainsi, celui qui trouve le bien, qu'il loue Allah, et celui qui trouve autre chose, qu'il ne s'en prenne qu'à lui-même.\n\n[Muslim]",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 24, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 25, 40 Hadith an-Nawawi",
                  "narrator": "D'après Abou Dharr (qu'Allah l'agrée) :",
                  "english_text": "Certains parmi les Compagnons du Messager d'Allah (sur lui la paix et le salut) ont dit au Prophète (sur lui la paix et le salut) : « Ô Messager d'Allah, les riches s'en sont emparés ; ils prient comme nous prions, ils jeûnent comme nous jeûnons et ils font [beaucoup] de charité en vertu de leur richesse. » Il (sur lui la paix et le salut) dit : « Allah n'a-t-il pas créé pour vous des choses à donner en aumône ? En vérité, toute tasbihah [dire : « subhan-Allah »] est une aumône, et toute takbirah [dire : « Allahu akbar »] est une aumône, et toute tahmidah [dire : « al-hamdu lillah »] est une aumône, et toute tahliélah [dire : « laa ilaha illAllah »] est une aumône. Ordonner le bien est une aumône, et interdire le mal est une aumône. Et dans le boud`i [acte sexuel] de chacun de vous il y a une aumône. »\n\nIls dirent : « Ô Messager d'Allah, quand l'un de nous satisfait son désir charnel, aura-t-il une récompense pour cela ? » Il (sur lui la paix et le salut) dit : « Ne vois-tu pas que s'il agissait de façon illicite, il mériterait un châtiment ? De même, s'il agissait de façon licite, il mériterait une récompense. »\n\n[Muslim]",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 25, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 26, 40 Hadith an-Nawawi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée) qui a dit :",
                  "english_text": "Le Messager d’Allah (sur lui la paix et le salut) a dit : « Chaque articulation de l’homme doit faire une aumône chaque jour au lever du soleil. Juger équitablement entre deux personnes est une aumône. Aider un homme à monter sur sa monture, le faire monter dessus ou y hisser ses affaires est une aumône. La bonne parole est une aumône. Chaque pas que vous faites vers la prière est une aumône. De même, enlever un objet nuisible du chemin est une aumône. »\n\n[Al-Bukhari]\n[Muslim]",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 26, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 27, 40 Hadith an-Nawawi",
                  "narrator": "D’après an-Nawas ibn Sam’an (qu’Allah l’agrée), le Prophète (sur lui la paix et le salut) a dit :",
                  "english_text": "FrançaisLa piété est une bonne conduite, et le mal est ce qui vacille dans ton âme et dont tu n’aimes pas que les gens apprennent l’existence.\n\n[Muslim]\nEt d’après Wabisah ibn Ma’bad (qu’Allah l’agrée) qui a dit :\n\nJe suis allé voir le Messager d’Allah (sur lui la paix et le salut) et il (sur lui la paix et le salut) m’a dit : « Tu es venu pour m’interroger sur la piété. » J’ai dit : « Oui. » Il (sur lui la paix et le salut) a dit : « Consulte ton cœur. La piété est ce qui apaise l’âme et apaise le cœur. Et le mal est ce qui vacille dans l’âme et cause un malaise dans la poitrine, même si les gens ont donné à plusieurs reprises leur avis juridique [en sa faveur]. »\nUn bon hadith transmis par les musnads des deux imams, Ahmed ibn Hambal et Ad-Darimi, avec une bonne chaîne d’autorité.",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 27, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 28, 40 Hadith an-Nawawi",
                  "narrator": "D’après Abu Najeeh al-’Irbaad ibn Saariyah (qu’Allah l’agrée) qui a dit :",
                  "english_text": "Le Messager d’Allah (sur lui la paix et le salut) nous a fait un sermon qui a rempli nos cœurs de crainte et nous a fait verser des larmes. Nous avons donc dit : « Ô Messager d’Allah ! C’est comme un sermon d’adieu, alors conseille-nous. » Il a dit : « Je vous conseille d’avoir la piété (taqwa) envers Allah, d’écouter et d’obéir [à votre chef], même si un esclave devenait votre amir. En vérité, celui d’entre vous qui vivra longtemps verra une grande controverse. Vous devez donc vous en tenir à ma Sunnah et à la Sunnah des Califes bien guidés, ceux qui guident sur le droit chemin. Tenez-vous-y obstinément [littéralement : avec vos molaires]. Méfiez-vous des choses nouvellement inventées [dans la religion], car en vérité, toute bidah (innovation) est un égarement. » [Abu Dawud]\nAt-Tirmidhi a rapporté que c'était un bon et vrai hadith.",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 28, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 29, 40 Hadith an-Nawawi",
                  "narrator": "D'après Muadh ibn Jabal (qu'Allah l'agrée) qui a dit :",
                  "english_text": "Je dis : « Ô Messager d’Allah, informe-moi d’un acte qui me fera entrer au Paradis et m’éloignera de l’Enfer. » Il (sur lui la paix et le salut) dit : « Tu m’as interrogé sur une grande affaire, mais elle est facile à celui à qui Allah la facilite : adorer Allah sans Lui associer aucun associé, accomplir la Salat, acquitter la Zakat, jeûner le Ramadan et faire le Pèlerinage à la Maison. »\n\nAlors il (sur lui la paix et le salut) dit : « Ne vais-je pas te guider vers les moyens du bien ? Le jeûne est un bouclier, l’aumône efface les péchés comme l’eau éteint le feu, et la prière d’un homme au plus profond de la nuit. » Puis il (sur lui la paix et le salut) récita : « [Ceux] qui abandonnent leur lit pour invoquer leur Seigneur par crainte et espoir, et qui dépensent (l’aumône dans le sentier d’Allah) de ce que Nous leur avons accordé. Personne ne sait ce qui leur est caché comme joie en récompense de ce qu’ils faisaient. » [as-Sajdah, 16-17]\n\nAlors il (que la paix et le salut d’Allah soient sur lui) dit : « Ne dois-je pas t’informer de la tête de l’affaire, de son pilier et de son sommet ? » J’ai dit : « Oui, ô Messager d’Allah. » Il (que la paix et le salut d’Allah soient sur lui) dit : « La tête de l’affaire est l’Islam, son pilier est la prière et son sommet est le jihad. » Puis il (que la paix et le salut d’Allah soient sur lui) dit : « Ne dois-je pas t’informer du fondement de tout cela ? » J’ai dit : « Oui, ô Messager d’Allah. » Alors il prit sa langue et dit : « Arrête cela. »\n\nJ’ai dit : « Ô Prophète d’Allah, allons-nous rendre des comptes pour ce que nous disons à ce sujet ? » Il (que la paix et le salut d’Allah soient sur lui) dit : « Que ta mère soit privée de toi, ô Muadh ! Y a-t-il quelque chose qui jette les gens dans le feu de l’Enfer sur leur visage – ou : sur leur nez – sinon les récoltes de leurs langues ? »\n\nCe hadith a été rapporté par at-Tirmidhi, qui a dit qu’il s’agissait d’un bon et vrai hadith.",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 29, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 30, 40 Hadith an-Nawawi",
                  "narrator": "D’après Abou Tha’labah al-Kouchani — Jurthoom bin Nashir (qu’Allah l’agrée) — le Messager d’Allah (sur lui la paix et le salut) a dit :",
                  "english_text": "Allah ta’ala a établi des obligations religieuses (fara’id), ne les négligez donc pas ; Il a fixé des limites, ne les transgressez donc pas ; Il a interdit certaines choses, ne les transgressez donc pas ; Il a gardé le silence sur certaines choses, par compassion pour vous et non par oubli ; ne les recherchez donc pas.\n\nUn hadith hasan rapporté par ad-Daraqutnee et d’autres.",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 30, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 31, 40 Hadith an-Nawawi",
                  "narrator": "D’après Abu al-’Abbas Sahl bin Sa’ad as-Sa’idee (qu’Allah l’agrée) qui a dit :",
                  "english_text": "Un homme vint trouver le Prophète (sur lui la paix et le salut) et lui dit : « Ô Messager d’Allah, ordonne-moi de faire un acte qui, si je le fais, fera que Dieu m’aime et que les gens m’aiment. » Il dit alors : « Renoncez au monde et Dieu vous aimera, et renoncez à ce que les gens possèdent et les gens vous aimeront. »\n\nHadith très bon rapporté par Ibn Majah et d’autres avec de bonnes sources.",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 31, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 32, 40 Hadith an-Nawawi",
                  "narrator": "D’après Abou Sa’id al-Khudri (qu’Allah l’agrée), le Messager d’Allah (sur lui la paix et le salut) a dit :",
                  "english_text": "Il ne doit y avoir ni préjudice (darar) ni préjudice réciproque (dirar).\n\nUn hadith hasan rapporté par Ibn Majah, ad-Daraqutnee et d'autres comme un hadith musnad. Il a également été rapporté par Malik dans al-Muwatta sous forme mursal d'après Amr bin Yahya, d'après son père d'après le Prophète (paix et bénédictions d'Allah sur lui), mais en laissant Abu Sa'eed de la chaîne. Et il y a d'autres chaînes de narrations qui se renforcent mutuellement.",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 32, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 33, 40 Hadith an-Nawawi",
                  "narrator": "D'après Ibn Abbas (qu'Allah l'agrée), le Messager d'Allah (sur lui la paix et le salut) a dit :",
                  "english_text": "Si l'on accordait aux gens tout ce qu'ils prétendent, les hommes s'approprieraient les biens et les vies des autres. Mais la charge de la preuve incombe à celui qui prétend, et le serment incombe à celui qui nie.\n\nUn hadith très bon rapporté par al-Baihaqee et d'autres sous cette forme, et une partie de celui-ci se trouve dans les deux Sahih.",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 33, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 34, 40 Hadith an-Nawawi",
                  "narrator": "D'après Abou Sa'id al-Khudri (qu'Allah l'agrée) qui a dit :",
                  "english_text": "J'ai entendu le Messager d'Allah (ﷺ) dire : « Quiconque d'entre vous voit un mal, qu'il le change avec sa main ; et s'il n'en est pas capable, qu'il le change avec sa langue ; et s'il n'en est pas capable, qu'il le change avec son cœur – et c'est là la plus faible des croyances. »\n\n[Muslim]",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 34, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 35, 40 Hadith an-Nawawi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée) qui a dit :",
                  "english_text": "Le Messager d’Allah (sur lui la paix et le salut) a dit : « Ne vous enviez pas les uns les autres, ne vous gonflez pas les prix les uns les autres, ne vous haïssez pas les uns les autres, ne vous détournez pas les uns des autres et ne vous rabaissez pas dans vos échanges commerciaux. Soyez plutôt esclaves d’Allah et frères. Le musulman est le frère d’un musulman : il ne l’opprime pas, ne le trahit pas, ne lui ment pas et ne le méprise pas. La piété est là [et il a montré sa poitrine trois fois]. Il est déjà assez mal pour un homme de mépriser son frère musulman. Tout le musulman est inviolable pour un autre musulman : son sang, ses biens et son honneur. »\n\n[Muslim]",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 35, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 36, 40 Hadith an-Nawawi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), le Prophète (sur lui la paix et le salut) a dit :",
                  "english_text": "Quiconque éloigne d'un croyant une souffrance présente, Allah lui éloignera une souffrance du Jour de la Résurrection. Et quiconque allège le besoin d'un nécessiteux, Allah l'allègera dans ce monde et dans l'au-delà. Quiconque cache les méfaits d'un musulman, Allah le protégera dans ce monde et dans l'au-delà. Et Allah assistera Son serviteur aussi longtemps qu'il assistera son frère. Et quiconque suit un chemin pour y chercher la science, Allah lui facilitera le chemin du Paradis. Il n'y a pas de gens qui se rassemblent dans l'une des Maisons d'Allah, lisant le Livre d'Allah et l'étudiant entre eux, sans que la quiétude ne descende sur eux, que la miséricorde ne les enveloppe, que les anges ne les entourent et qu'Allah ne les mentionne parmi ceux qui sont avec Lui. Et quiconque est retardé par ses actions, ne sera pas hâté par sa lignée. \n\nRapporté par [Muslim] dans ces paroles.",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 36, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 37, 40 Hadith an-Nawawi",
                  "narrator": "D'après Ibn Abbas (qu'Allah l'agrée), le Messager d'Allah (sur lui la paix et le salut) a rapporté d'après son Seigneur :",
                  "english_text": "Allah ta’ala a écrit les bonnes actions et les mauvaises actions, et l’a expliqué ensuite [en disant] : « Quiconque a eu l’intention d’accomplir une bonne action, mais ne l’a pas accomplie, alors Allah l’inscrit auprès de Lui comme une bonne action complète. Et s’il a eu l’intention de l’accomplir et l’a accomplie, alors Allah l’inscrit auprès de Lui comme une bonne action complète allant de dix bonnes actions jusqu’à sept cents fois, jusqu’à plusieurs fois multipliées. Et s’il a eu l’intention d’accomplir une mauvaise action, mais ne l’a pas accomplie, alors Allah l’inscrit auprès de Lui comme une bonne action complète. Et s’il a eu l’intention de l’accomplir [c’est-à-dire la mauvaise action] et l’a accomplie, alors Allah l’inscrit comme une seule mauvaise action. »\n\n[Al-Bukhari]\n[Muslim].",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 37, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 38, 40 Hadith an-Nawawi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée) qui a dit :",
                  "english_text": "Le Messager d’Allah (sur lui la paix et le salut) a dit : « En vérité, Allah ta’ala a dit : « Quiconque se montre hostile à l’un de Mes amis, alors Je lui déclare la guerre. Et Mon serviteur ne se rapproche de Moi que par les devoirs religieux que Je lui ai imposés. Et Mon serviteur continue de se rapprocher de Moi par des actes surérogatoires jusqu’à ce que Je l’aime. Quand Je l’aime, Je suis son ouïe avec laquelle il entend, sa vue avec laquelle il voit, sa main avec laquelle il frappe et son pied avec lequel il marche. S’il Me demandait quelque chose, Je le lui donnerais certainement ; et s’il cherchait refuge auprès de Moi, Je lui accorderais certainement refuge. »\n\n[Al-Bukhari]",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 38, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 39, 40 Hadith an-Nawawi",
                  "narrator": "D'après Ibn Abbas (qu'Allah l'agrée), le Messager d'Allah (sur lui la paix et le salut) a dit :",
                  "english_text": "En vérité, Allah m'a pardonné, à moi et à ma communauté, leurs erreurs, leurs oublis et ce qu'ils ont été contraints de faire.\n\nHadîth hassan rapporté par Ibn Majah, al-Bayhaqî et d'autres.",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 39, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 40, 40 Hadith an-Nawawi",
                  "narrator": "D'après Abdallah ibn Omar (qu'Allah l'agrée) qui a dit :",
                  "english_text": "Le Messager d’Allah (sur lui la paix et le salut) m’a pris par l’épaule et m’a dit : « Sois dans ce monde comme si tu étais un étranger ou un voyageur. » \n\nEt Ibn Omar (qu’Allah l’agrée) disait : « Le soir, ne t’attends pas à vivre jusqu’au matin, et le matin, ne t’attends pas à vivre jusqu’au soir. Profite de ta santé avant les périodes de maladie, et profite de ta vie avant de mourir. » \n\n[Al-Bukhari]",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 40, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 41, 40 Hadith an-Nawawi",
                  "narrator": "D’après Abu Muhammad Abdullah bin ’Amr bin al-’Aas (qu’Allah l’agrée) qui a dit :",
                  "english_text": "Le Messager d’Allah (sur lui la paix et le salut) a dit : « Aucun d’entre vous ne croit vraiment tant que ses désirs ne sont pas soumis à ce que j’ai apporté. »\n\n[L’Imam an-Nawawi dit :] Nous l’avons rapporté dans Kitab al-Hujjah par une chaîne de narrateurs authentiques.",
                  "arabic_text": "عَنْ أَبِي مُحَمَّدٍ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ رَضِيَ اللَّهُ عَنْهُمَا، قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم \"لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يَكُونَ هَوَاهُ تَبَعًا لِمَا جِئْتُ بِهِ\". \nحَدِيثٌ حَسَنٌ صَحِيحٌ، رَوَيْنَاهُ فِي كِتَابِ \"الْحُجَّةِ\" بِإِسْنَادٍ صَحِيحٍ.",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 41, 40 Hadith an-Nawawi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 42, 40 Hadith an-Nawawi",
                  "narrator": "D'après Anas (qu'Allah l'agrée) qui a dit :",
                  "english_text": "J’ai entendu le Messager d’Allah (sur lui la paix et le salut) dire : « Allah, le Tout-Puissant, a dit : « Ô fils d’Adam, aussi longtemps que tu M’invoqueras et Me demanderas pardon, Je te pardonnerai ce que tu as fait, et Je ne m’en soucierai pas. Ô fils d’Adam, si tes péchés atteignaient les nuages ​​du ciel et que tu Me demandais pardon, Je te pardonnerais. Ô fils d’Adam, si tu venais à Moi avec des péchés presque aussi grands que la Terre, et si tu te présentais alors à Moi sans M’attribuer aucun associé, Je t’accorderais un pardon presque aussi grand. » \n\nCe hadith a été rapporté par at-Tirmidhi, qui a dit que c’était un hadith bon.",
                  "arabic_text": null,
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 42, 40 Hadith an-Nawawi"
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "book_number": "",
          "english_book_name": "Quarante Hadith Qudsi",
          "arabic_book_name": "الحديث القدسي",
          "book_range": "1 to 40",
          "link": "https://sunnah.com/qudsi40",
          "chapters_and_hadiths": [
            {
              "chapter_no": null,
              "chapter_title_english": "Hadiths orphelins",
              "chapter_title_arabic": null,
              "hadiths": [
                {
                  "reference": "Hadith 1, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit :",
                  "english_text": "Quand Allah a décrété la Création, Il s'est engagé à écrire dans Son Livre qui est déposé auprès de Lui : Ma miséricorde l'emporte sur ma colère.\n\nRapporté par Muslim (ainsi que par al-Bukhari, an-Nasa'i et Ibn Majah).",
                  "arabic_text": "\" لَمَّا قَضَى اللَّهُ الْخَلْقَ، كَتَبَ فِي كِتَابِهِ عَلَى نَفْسِهِ، فَهُوَ مَوْضُوعٌ عِنْدَهُ: إِنَّ رَحْمَتِي تَغْلِبُ غَضَبِي\"",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 1, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 2, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit :",
                  "english_text": "Allah Tout-Puissant a dit :\nLe fils d'Adam M'a renié et il n'avait aucun droit de le faire. Et il M'a insulté et il n'avait aucun droit de le faire. Quant à son renoncement à Moi, c'est sa parole : Il ne me refaçonnera pas comme Il m'a fait la première fois (1) - et la création initiale [de lui] ne M'est pas plus facile que de le refaire. Quant à son insulte à Moi, c'est sa parole : Allah s'est attribué un fils, alors que Je suis l'Unique, le Refuge éternel. Je n'ai pas engendré, je n'ai pas été engendré et il n'y a personne qui Me soit comparable (1) c'est-à-dire, ramène-moi à la vie après la mort.\n\nRapporté par al-Boukhari (et aussi par an-Nasa'i).",
                  "arabic_text": "\" قَالَ اللَّهُ تَعَالَى: كَذَّبَنِي ابْنُ آدَمَ وَلَمْ يَكُنْ لَهُ ذَلِكَ، وَشَتَمَنِي وَلَمْ يَكُنْ لَهُ ذَلِكَ، فَأَمَّا تَكْذِيبُهُ إِيَّايَ فَقَوْلُهُ: لَنْ يُعِيدَنِي كَمَا بَدَأَنِي، وَلَيْسَ أَوَّلُ الْخَلْقِ بِأَهْوَنَ عَلَيَّ مِنْ إِعَادَتِهِ، وَأَمَّا شَتْمُهُ إِيَّايَ فَقَوْلُهُ: اتَّخَذَ اللَّهُ وَلَدًا، وَأَنَا الْأَحَدُ الصَّمَدُ، لَمْ أَلِدْ وَلَمْ أُولَدْ، وَلَمْ يَكُنْ لِي كُفُوًا أَحَدٌ\"",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 2, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 3, 40 Hadith Qudsi",
                  "narrator": "D'après Zayd ibn Khalid al-Juhaniyy (qu'Allah l'agrée) qui a dit :",
                  "english_text": "FrançaisLe Messager d'Allah (sur lui la paix et le salut) dirigea pour nous la prière du matin à al-Hudaybiyah après une pluie tombée pendant la nuit. Quand le Prophète (sur lui la paix et le salut) eut terminé, il se tourna vers les gens et leur dit : « Savez-vous ce qu'a dit votre Seigneur ? » Ils dirent : « Allah et son Messager le savent mieux. » Il dit : « Ce matin, l'un de mes serviteurs est devenu croyant en Moi et l'autre mécréant. Quant à celui qui dit : « C'est par la grâce d'Allah et de Sa miséricorde que nous avons reçu la pluie, celui-là est croyant en Moi et mécréant aux étoiles » (2) ; et quant à celui qui dit : « C'est par telle étoile que nous avons reçu la pluie, celui-là est mécréant en Moi et croyant aux étoiles » (3). \n(3) Les Arabes préislamiques croyaient que la pluie était provoquée par le mouvement des étoiles. Ce hadith attire l'attention sur le fait que quelle que soit la cause directe d'un phénomène naturel tel que la pluie, c'est Allah le Tout-Puissant qui dispose de toutes choses.\n\nIl a été rapporté par al-Bukhari (également par Malik et an-Nasa'i).",
                  "arabic_text": "عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، رَضِيَ اللَّهُ عَنْهُ قَالَ: \n\"صَلَّى لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الصُّبْحِ بِالْحُدَيْبِيَةِ، عَلَى إِثْرِ سَمَاءٍ (1) كَانَتْ مِنْ اللَّيْلَةِ، فَلَمَّا انْصَرَفَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْبَلَ عَلَى النَّاسِ، فَقَالَ لَهُمْ: \"هَلْ تَدْرُونَ مَاذَا قَالَ رَبُّكُمْ؟ قَالُوا: اللَّهُ وَرَسُولُهُ أَعْلَمُ، قَالَ: أَصْبَحَ مِنْ عِبَادِي مُؤْمِنٌ بِي وَكَافِرٌ، فَأَمَّا مَنْ قَالَ: مُطِرْنَا بِفَضْلِ اللَّهِ وَرَحْمَتِهِ، فَذَلِكَ مُؤْمِنٌ بِي، كَافِرٌ بِالْكَوْكَبِ، وَأَمَّا مَنْ قَالَ: مُطِرْنَا بِنَوْءِ(1) كَذَا وَكَذَا، فَذَلِكَ كَافِرٌ بِي، مُؤْمِنٌ بِالْكَوْكَبِ\" \nرواه البخاري (وكذلك مالك والنسائي)",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 3, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 4, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit :",
                  "english_text": "Allah a dit :\nLes fils d'Adam invectivent contre le Temps, et Je suis le Temps, et dans Ma main se trouvent la nuit et le jour. (1) (1) Comme le Tout-Puissant est l'Ordonnateur de toute chose, invectiver contre les malheurs qui font partie du Temps équivaut à invectiver contre Lui.\n\nRapporté par al-Boukhari (et aussi par Mouslim).",
                  "arabic_text": "\" قَالَ اللَّهُ: يَسُبُّ بَنُو آدَمَ الدَّهْرَ، وَأَنَا الدَّهْرُ، بِيَدِي اللَّيْلُ وَالنَّهَارُ\"",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 4, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 5, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit :",
                  "english_text": "Allah (qu'Il soit glorifié et exalté) a dit :\nJe suis si autosuffisant que Je n'ai pas besoin d'avoir d'associé. Ainsi, quiconque accomplit une action pour le bien d'autrui en plus du mien, Je renonce à cette action en faveur de celui qu'il M'a associé.\n\nRapporté par Muslim (et également par Ibn Majah).",
                  "arabic_text": "\" قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى: أَنَا أَغْنَى الشُّرَكَاءِ عَنْ الشِّرْكِ؛ مَنْ عَمِلَ عَمَلًا أَشْرَكَ مَعِي غَيْرِي(1)، تَرَكْتُهُ وَشِرْكَهُ\"",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 5, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 6, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée) :",
                  "english_text": "J'ai entendu le Messager d'Allah (ﷺ) dire :\nLe premier des gens qui seront jugés au Jour de la Résurrection sera un homme mort en martyr. On l'amènera et Allah lui fera connaître Ses bienfaits et il les reconnaîtra. [Le Tout-Puissant] dira : Et qu'avez-vous fait d'eux ? Il dira : J'ai combattu pour vous jusqu'à ma mort en martyr. Il dira : Vous avez menti. Vous n'avez combattu que pour qu'on dise [de vous] : Il est courageux. Et c'est ce qu'on a dit. Puis on ordonnera de le traîner sur son visage jusqu'à ce qu'il soit jeté en Enfer. [Un autre] sera un homme qui a étudié la science [religieuse] et l'a enseignée et qui récitait le Coran. On l'amènera et Allah lui fera connaître Ses bienfaits et il les reconnaîtra. [Le Tout-Puissant] dira : Et qu'avez-vous fait d'eux ? Il dira : « J'ai étudié la science, je l'ai enseignée et j'ai récité le Coran pour Toi. » Il dira : « Tu as menti. Tu n'as étudié la science que pour qu'on dise : « Il est savant. » Et tu as récité le Coran pour qu'on dise : « Il est récitant. » Et il fut dit ainsi. Puis il sera ordonné de le traîner sur son visage jusqu'à ce qu'il soit jeté dans le Feu de l'Enfer. Il y aura un homme qu'Allah a enrichi et à qui Il a donné toutes sortes de biens. On l'amènera et Allah lui fera connaître Ses bienfaits et il les reconnaîtra. » « Et qu'as-tu fait d'eux ? » Il dira : « Je n'ai laissé aucune voie [non foulée] où Tu aimes que l'on dépense de l'argent sans y dépenser pour Toi. » Il dira : « Tu as menti. Tu l'as fait pour qu'on dise : « Il est généreux. » Et il fut dit ainsi. Ensuite, on lui ordonnera de le traîner sur le visage jusqu'à ce qu'il soit jeté dans le feu de l'Enfer.\n\nRapporté par Muslim (également par at-Tirmidhi et an-Nasa'i).",
                  "arabic_text": "\" إِنَّ أَوَّلَ النَّاسِ يُقْضَى يَوْمَ الْقِيَامَةِ عَلَيْهِ رَجُلٌ اسْتُشْهِدَ، فَأُتِيَ بِهِ فَعَرَّفَهُ نِعَمَهُ فَعَرَفَهَا، قَالَ: فَمَا عَمِلْتَ فِيهَا؟ قَالَ قَاتَلْتُ فِيكَ حَتَّى اسْتُشْهِدْتُ، قَالَ: كَذَبْتَ، وَلَكِنَّكَ قَاتَلْتَ لِأَنْ يُقَالَ: جَرِيءٌ، فَقَدْ قِيلَ، ثُمَّ أُمِرَ بِهِ فَسُحِبَ عَلَى وَجْهِهِ حَتَّى أُلْقِيَ فِي النَّارِ. وَرَجُلٌ تَعَلَّمَ الْعِلْمَ وَعَلَّمَهُ وَقَرَأَ الْقُرْآنَ، فَأُتِيَ بِهِ، فَعَرَّفَهُ نِعَمَهُ فَعَرَفَهَا، قَالَ: فَمَا عَمِلْتَ فِيهَا؟ قَالَ: تَعَلَّمْتُ الْعِلْمَ وَعَلَّمْتُهُ، وَقَرَأْتُ فِيكَ الْقُرْآنَ، قَالَ: كَذَبْتَ، وَلَكِنَّكَ تَعَلَّمْتَ الْعِلْمَ لِيُقَالَ: عَالِمٌ، وَقَرَأْتَ الْقُرْآنَ لِيُقَالَ: هُوَ قَارِئٌ، فَقَدْ قِيلَ، ثُمَّ أُمِرَ بِهِ، فَسُحِبَ عَلَى وَجْهِهِ حَتَّى أُلْقِيَ فِي النَّارِ. وَرَجُلٌ وَسَّعَ اللَّهُ عَلَيْهِ، وَأَعْطَاهُ مِنْ أَصْنَافِ الْمَالِ كُلِّهِ، فَأُتِيَ بِهِ، فَعَرَّفَهُ نِعَمَهُ فَعَرَفَهَا، قَالَ: فَمَا عَمِلْتَ فِيهَا؟ قَالَ: مَا تَرَكْتُ مِنْ سَبِيلٍ تُحِبُّ أَنْ يُنْفَقَ فِيهَا إِلَّا أَنْفَقْتُ فِيهَا لَكَ، قَالَ: كَذَبْتَ، وَلَكِنَّكَ فَعَلْتَ لِيُقَالَ: هُوَ جَوَادٌ، فَقَدْ قِيلَ، ثُمَّ أُمِرَ بِهِ فَسُحِبَ عَلَى وَجْهِهِ، ثُمَّ أُلْقِيَ فِي النَّارِ\"",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 6, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 7, 40 Hadith Qudsi",
                  "narrator": "D'après Uqbah ibn Amir (qu'Allah l'agrée) qui a dit :",
                  "english_text": "J'ai entendu le Messager d'Allah (ﷺ) dire :\nTon Seigneur se réjouit d'un berger qui, au sommet d'une montagne escarpée, appelle à la prière et prie. Alors Allah (qu'Il soit glorifié et exalté) dit : Regarde ce serviteur qui est à Moi, il appelle à la prière et accomplit les prières ; il Me craint. J'ai pardonné à Mon serviteur [ses péchés] et je l'ai fait entrer au Paradis.\n\nC'est ce qu'a rapporté an-Nasa'i d'une bonne chaîne de sources.",
                  "arabic_text": "\" يَعْجَبُ رَبُّكَ مِنْ رَاعِي غَنَمٍ، فِي رَأْسِ شَظِيَّةِ الْجَبَلِ(1)، يُؤَذِّنُ بِالصَّلَاةِ وَيُصَلِّي، فَيَقُولُ اللَّهُ، عَزَّ وَجَلَّ: انْظُرُوا إِلَى عَبْدِي هَذَا، يُؤَذِّنُ وَيُقِيمُ الصَّلَاةَ، يَخَافُ مِنِّي، قَدْ غَفَرْتُ لِعَبْدِي، وَأَدْخَلْتُهُ الْجَنَّةَ\"",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 7, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 8, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), le Prophète (ﷺ) a dit :",
                  "english_text": "Français Une prière accomplie par quelqu'un qui n'a pas récité l'Essence du Coran (1) pendant celle-ci est déficiente (et il a répété le mot trois fois), incomplète. Quelqu'un dit à Abou Hourayra : [Même si] nous sommes derrière l'imam ? (2) Il dit : Récite-la toi-même, car j'ai entendu le Prophète (bénédiction et salut soient sur lui) dire : Allah (puissant et sublime) a dit : J'ai divisé la prière entre Moi et Mon serviteur en deux moitiés, et Mon serviteur aura ce qu'il a demandé. Lorsque le serviteur dit : Al-hamdu lillahi rabbi l-alamin (3), Allah (puissant et sublime) dit : Mon serviteur M'a loué. Et quand il dit : Ar-rahmani r-rahim (4), Allah (puissant et sublime) dit : Mon serviteur M'a exalté, et quand il dit : Maliki yawmi d-din (5), Allah dit : Mon serviteur M'a glorifié - et à une occasion Il a dit : Mon serviteur s'est soumis à Mon pouvoir. Et quand il dit : Iyyaka na budu wa iyyaka nasta in (6), Il dit : Ceci est entre Moi et Mon serviteur, et Mon serviteur aura ce qu'il a demandé. Et quand il dit : Ihdina s-sirata l- mustaqim, siratal ladhina an amta alayhim ghayril-maghdubi alayhim wa la d-dallin (7), Il dit : Ceci est pour Mon serviteur, et Mon serviteur aura ce qu'il a demandé.\n(1) Sourate al-Fatihah, la première sourate (chapitre) du Coran.\n(2) c'est-à-dire se tenir derrière l'imam (chef) et l'écouter réciter al-Fatihah.\n(3) \"Louange à Allah, Seigneur des Mondes.\"\n(4) \"Le Miséricordieux, le Compatissant\".\n(5) \"Maître du Jour du Jugement\".\n(6) \"C'est Toi que nous adorons et c'est Toi que nous implorons secours\".\n(7) \"Guide-nous vers le droit chemin, le chemin de ceux que Tu as comblés de faveurs, non de ceux contre qui Tu es en colère, ni de ceux qui s'égarent\".\n\nRapporté par Muslim (également par Malik, at-Tirmidhi, Abu-Dawud, an-Nasa'i et Ibn Majah).",
                  "arabic_text": "\" مَنْ صَلَّى صَلَاةً لَمْ يَقْرَأْ فِيهَا بِأُمِّ الْقُرْآنِ، فَهِيَ خِدَاجٌ(1) ثَلَاثًا، غَيْرَ تَمَامٍ، فَقِيلَ لِأَبِي هُرَيْرَةَ: إِنَّا نَكُونُ وَرَاءَ الْإِمَامِ، فَقَالَ: اقْرَأْ بِهَا فِي نَفْسِكَ، فَإِنِّي سَمِعْتُ النبي صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: قَالَ اللَّهُ عَزَّ وَجَلَّ: قَسَمْتُ الصَّلَاةَ بَيْنِي وَبَيْنَ عَبْدِي نِصْفَيْنِ، وَلِعَبْدِي مَا سَأَلَ، فَإِذَا قَالَ الْعَبْدُ:{ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ } قَالَ اللَّهُ عَزَّ وَجَلَّ: حَمِدَنِي عَبْدِي، وَإِذَا قَالَ:{ الرَّحْمَنِ الرَّحِيمِ } قَالَ اللَّهُ عَزَّ وَجَلَّ: أَثْنَى عَلَيَّ عَبْدِي، وَإِذَا قَالَ:{ مَالِكِ يَوْمِ الدِّينِ } قَالَ اللَّهُ: مَجَّدَنِي عَبْدِي - وَقَالَ مَرَّةً: فَوَّضَ إِلَيَّ عَبْدِي، فَإِذَا قَالَ:{ إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ } قَالَ: هَذَا بَيْنِي وَبَيْنَ عَبْدِي وَلِعَبْدِي مَا سَأَلَ، فَإِذَا قَالَ:{ اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ } قَالَ: هَذَا لِعَبْدِي وَلِعَبْدِي مَا سَأَلَ\"",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 8, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 9, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), le Prophète (ﷺ) a dit :",
                  "english_text": "Allah (puissant et sublime) dit :\nLa première des actions dont le serviteur d'Allah sera tenu responsable au Jour de la Résurrection sera ses prières. Si elles sont en ordre, alors il aura prospéré et réussi ; et si elles sont insuffisantes, alors il aura échoué et perdu. Si quelque chose défaille dans ses prières obligatoires, le Seigneur (glorifié et exalté soit-Il) dira : Regarde si Mon serviteur a des prières surérogatoires avec lesquelles compléter ce qui était défectueux dans ses prières obligatoires. Alors le reste de ses actions sera jugé de la même manière.\n\nRapporté par at-Tirmidhi (également par Abu Dawud, an-Nasa'i, Ibn Majah et Ahmad).",
                  "arabic_text": "\"إِنَّ أَوَّلَ مَا يُحَاسَبُ بِهِ الْعَبْدُ يَوْمَ الْقِيَامَةِ مِنْ عَمَلِهِ صَلَاتُهُ. فَإِنْ صَلُحَتْ فَقَدْ أَفْلَحَ وَأَنْجَحَ، وَإِنْ فَسَدَتْ فَقَدْ خَابَ وَخَسِرَ، فَإِنْ انْتَقَصَ مِنْ فَرِيضَتِهِ شَيْءٌ، قَالَ الرَّبُّ عَزَّ وَجَلَّ: انْظُرُوا هَلْ لِعَبْدِي مِنْ تَطَوُّعٍ فَيُكَمَّلَ بِهَا مَا انْتَقَصَ مِنْ الْفَرِيضَةِ، ثُمَّ يَكُونُ سَائِرُ عَمَلِهِ عَلَى ذَلِكَ\"",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 9, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 10, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), le Prophète (ﷺ) a dit :",
                  "english_text": "Allah (puissant et sublime) dit :\nLe jeûne M'appartient et c'est Moi qui le récompense. [L'homme] renonce à ses passions, à sa nourriture et à sa boisson pour Moi. Le jeûne est comme un bouclier, et celui qui jeûne a deux joies : la joie de rompre son jeûne et la joie de rencontrer son Seigneur. Le changement dans l'haleine de celui qui jeûne est meilleur aux yeux d'Allah que l'odeur du musc.\n\nRapporté par al-Boukhari (et aussi par Mouslim, Malik, at-Tirmidhi, an-Nasa'i et Ibn Majah).",
                  "arabic_text": "\" يَقُولُ اللَّهُ عَزَّ وَجَلَّ: الصَّوْمُ لِي، وَأَنَا أَجْزِي بِهِ، يَدَعُ شَهْوَتَهُ وَأَكْلَهُ وَشُرْبَهُ مِنْ أَجْلِي، وَالصَّوْمُ جُنَّةٌ(1)، وَلِلصَّائِمِ فَرْحَتَانِ: فَرْحَةٌ حِينَ يُفْطِرُ، وَفَرْحَةٌ حِينَ يَلْقَى رَبَّهُ، وَلَخُلُوفُ(2) فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ\"",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 10, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 11, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Harayrah (qu'Allah l'agrée), le Prophète (ﷺ) a dit :",
                  "english_text": "Allah (puissant et sublime) a dit :\nDépense (en aumône), ô fils d'Adam, et je dépenserai pour toi.\n\nRapporté par al-Boukhari (et aussi par Muslim).",
                  "arabic_text": "\" قَالَ اللَّهُ: أَنْفِقْ يَا ابْنَ آدَمَ، أُنْفِقْ عَلَيْكَ \"",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 11, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 12, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Mas'oud al-Ansârî (qu'Allah l'agrée), le Messager d'Allah (sur lui la bénédiction et le salut) a dit :",
                  "english_text": "Un homme d'entre ceux qui vous ont précédés fut appelé à rendre des comptes. Il ne lui fut trouvé de bien que d'avoir des relations avec les gens et, étant aisé, d'ordonner à ses serviteurs de libérer l'homme dans la précarité. Il (le Prophète) a rapporté qu'Allah a dit : « Nous méritons cela plus que vous. Libérez-le. »\n\nRapporté par Muslim (ainsi que par al-Boukhari et an-Nasa'i).",
                  "arabic_text": "\" حُوسِبَ رَجُلٌ مِمَّنْ كَانَ قَبْلَكُمْ، فَلَمْ يُوجَدْ لَهُ مِنْ الْخَيْرِ شَيْءٌ، إِلَّا أَنَّهُ كَانَ يُخَالِطُ(1) النَّاسَ، وَكَانَ مُوسِرًا، فَكَانَ يَأْمُرُ غِلْمَانَهُ أَنْ يَتَجَاوَزُوا عَنْ الْمُعْسِرِ، قَالَ (2) قَالَ اللَّهُ : نَحْنُ أَحَقُّ بِذَلِكَ مِنْكَ، تَجَاوَزُوا عَنْهُ\"",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 12, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 13, 40 Hadith Qudsi",
                  "narrator": "D'après Adiyy ibn Hatim (qu'Allah l'agrée), qui a dit :",
                  "english_text": "FrançaisJ'étais avec le Messager d'Allah (sur lui la bénédiction et la paix) et deux hommes vinrent à lui. L'un se plaignait de la pauvreté, tandis que l'autre se plaignait du brigandage. Le Messager d'Allah (sur lui la bénédiction et la paix) dit : « Quant au brigandage, il ne faudra pas longtemps avant qu'une caravane sorte de La Mecque sans garde. Quant à la pauvreté, l'Heure n'arrivera pas avant que l'un de vous ne promène son aumône sans trouver personne pour l'accepter de lui. Alors l'un de vous se tiendra devant Allah, sans qu'il n'y ait entre Lui et lui aucun écran, ni interprète pour lui traduire. Puis Il lui dira : « Ne t'ai-je pas apporté des biens ? » Et il dira : « Oui. » Puis Il dira : « Ne t'ai-je pas envoyé un messager ? » Et il dira : « Oui. » Et il regardera à sa droite et ne verra que le feu de l'Enfer, puis il regardera à sa gauche et ne verra que le feu de l'Enfer. Que chacun de vous se protège donc du feu de l'Enfer, ne serait-ce qu'avec une demi-datte - et s'il n'en trouve pas, qu'il dise quelque chose de bien. \n(1) c'est-à-dire au moment de l'Heure. \n\nRapporté par al-Boukhari.",
                  "arabic_text": "\"كُنْتُ عِنْدَ رَسُولِ اللَّهِ، صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَجَاءَهُ رَجُلَانِ: أَحَدُهُمَا يَشْكُو الْعَيْلَةَ(1)، وَالْآخَرُ يَشْكُو قَطْعَ السَّبِيلِ(2)، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَمَّا قَطْعُ السَّبِيلِ فَإِنَّهُ لَا يَأْتِي عَلَيْكَ إِلَّا قَلِيلٌ، حَتَّى تَخْرُجَ الْعِيرُ إِلَى مَكَّةَ بِغَيْرِ خَفِيرٍ. وَأَمَّا الْعَيْلَةُ، فَإِنَّ السَّاعَةَ لَا تَقُومُ حَتَّى يَطُوفَ أَحَدُكُمْ بِصَدَقَتِهِ، لَا يَجِدُ مَنْ يَقْبَلُهَا مِنْهُ، ثُمَّ لَيَقِفَنَّ أَحَدُكُمْ بَيْنَ يَدَيْ اللَّهِ، لَيْسَ بَيْنَهُ وَبَيْنَهُ حِجَابٌ وَلَا تَرْجُمَانٌ يُتَرْجِمُ لَهُ، ثُمَّ لَيَقُولَنَّ لَهُ: أَلَمْ أُوتِكَ مَالًا؟ فَلَيَقُولَنَّ: بَلَى، ثُمَّ لَيَقُولَنَّ: أَلَمْ أُرْسِلْ إِلَيْكَ رَسُولًا؟ فَلَيَقُولَنَّ: بَلَى، فَيَنْظُرُ عَنْ يَمِينِهِ، فَلَا يَرَى إِلَّا النَّارَ، ثُمَّ يَنْظُرُ عَنْ شِمَالِهِ، فَلَا يَرَى إِلَّا النَّارَ، فَلْيَتَّقِيَنَّ أَحَدُكُمْ النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ، فَإِنْ لَمْ يَجِدْ فَبِكَلِمَةٍ طَيِّبَةٍ\"",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 13, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 14, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), le Prophète (ﷺ) a dit :",
                  "english_text": "Allah (qu'Il soit glorifié et exalté) a des anges surnuméraires qui errent à la recherche des rassemblements dans lesquels le nom d'Allah est invoqué : ils s'assoient avec eux et replient leurs ailes les uns autour des autres, remplissant ce qui est entre eux et entre le ciel le plus bas. Quand [les gens du rassemblement] partent, [les anges] montent et s'élèvent au ciel. Il (le Prophète) dit : Alors Allah (puissant et sublime) leur demande - [bien que] Il soit le plus savant à leur sujet : D'où venez-vous ? Et ils disent : Nous venons de chez certains de Tes serviteurs sur terre : ils Te glorifiaient (Subhana llah), T'exalt (Allahu akbar), témoignaient qu'il n'y a de dieu que Toi (La ilaha illa llah), Te louaient (Al-Hamdu lillah) et Te demandaient [des faveurs]. Il dit : Et que Me demandent-ils ? Ils disent : Ils Te demandent Ton Paradis. Français : Il dit : Et ont-ils vu Mon Paradis ? Ils disent : Non, ô Seigneur. Il dit : Et comment cela serait-il s'ils avaient vu Mon Paradis ? Ils disent : Et ils demandent protection auprès de Toi. Il dit : De quoi Me demandent-ils protection ? Ils disent : De Ton Enfer, ô Seigneur. Il dit : Et ont-ils vu Mon Enfer ? Ils disent : NON. Il dit : Et comment cela serait-il s'ils avaient vu Mon Enfer ? Ils disent : Et ils demandent Ton pardon. Il (le Prophète) dit : Puis Il dit : Je leur ai pardonné et Je leur ai accordé ce qu'ils ont demandé, et Je leur ai accordé protection contre ce contre quoi ils ont demandé protection. Il (le Prophète) dit : Ils disent : Ô Seigneur, parmi eux se trouve Untel, un serviteur grand pécheur, qui ne faisait que passer et s'est assis avec eux. Il (le Prophète) a dit : Et Il dit : Et à lui aussi J'ai accordé le pardon : celui qui s'assoit avec de telles personnes ne souffrira pas.\n\nRapporté par Muslim (également par al-Bukhari, at-Tirmidhi et an-Nasa'i).",
                  "arabic_text": "\" إِنَّ لِلَّهِ تَبَارَكَ وَتَعَالَى مَلَائِكَةً سَيَّارَةً فُضُلًا(1)، يَتَتَبَّعُونَ مَجَالِسَ الذِّكْرِ، فَإِذَا وَجَدُوا مَجْلِسًا فِيهِ ذِكْرٌ، قَعَدُوا مَعَهُمْ، وَحَفَّ بَعْضُهُمْ بَعْضًا بِأَجْنِحَتِهِمْ، حَتَّى يَمْلَأُوا مَا بَيْنَهُمْ وَبَيْنَ السَّمَاءِ الدُّنْيَا، فَإِذَااْنْصَرَفُوا عَرَجُوا وَصَعِدُوا إِلَى السَّمَاءِ، قَالَ (2) : فَيَسْأَلُهُمْ اللَّهُ عَزَّ وَجَلَّ وَهُوَ أَعْلَمُ بِهِمْ: مِنْ أَيْنَ جِئْتُمْ؟ فَيَقُولُونَ: جِئْنَا مِنْ عِنْدِ عِبَادٍ لَكَ فِي الْأَرْضِ، يُسَبِّحُونَكَ وَيُكَبِّرُونَكَ وَيُهَلِّلُونَكَ وَيَحْمَدُونَكَ وَيَسْأَلُونَكَ، قَالَ: وَمَا يَسْأَلُونِي؟ قَالُوا يَسْأَلُونَكَ جَنَّتَكَ، قَالَ: وَهَلْ رَأَوْا جَنَّتِي؟ قَالُوا: لَا أَيْ رَبِّ، قَالَ: فَكَيْفَ لَوْ رَأَوْا جَنَّتِي! قَالُوا: وَيَسْتَجِيرُونَكَ، قَالَ: وَمِمَّ يَسْتَجِيرُونَي؟ قَالُوا: مِنْ نَارِكَ يَا رَبِّ، قَالَ: وَهَلْ رَأَوْا نَارِي؟ قَالُوا: لَا، قَالَ: فَكَيْفَ لَوْ رَأَوْا نَارِي! قَالُوا: وَيَسْتَغْفِرُونَكَ، قَالَ (1) فَيَقُولُ: قَدْ غَفَرْتُ لَهُمْ، وأَعْطَيْتُهُمْ مَا سَأَلُوا، وَأَجَرْتُهُمْ مِمَّا اسْتَجَارُوا، قَالَ(1) يَقُولُونَ: رَبِّ فِيهِمْ فُلَانٌ، عَبْدٌ خَطَّاءٌ إِنَّمَا مَرَّ فَجَلَسَ مَعَهُمْ، قَالَ(1): فَيَقُولُ: وَلَهُ غَفَرْتُ؛ هُمْ الْقَوْمُ، لَا يَشْقَى بِهِمْ جَلِيسُهُمْ\"",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 14, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 15, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), le Prophète (ﷺ) a dit :",
                  "english_text": "Allah le Tout-Puissant a dit :\nJe suis tel que Mon serviteur pense que Je suis (1). Je suis avec lui lorsqu'il Me mentionne. S'il Me mentionne en lui-même, Je le mentionne en Moi-même ; et s'il Me mentionne dans une assemblée, Je le mentionne dans une assemblée meilleure qu'elle. Et s'il s'approche de Moi d'une longueur de bras, Je m'approche de lui d'une coudée, et s'il s'approche de Moi d'une coudée, Je m'approche de lui d'une brasse. Et s'il vient à Moi en marchant, Je vais à lui à toute vitesse.\n(1) Une autre traduction possible de l'arabe est : \"Je suis tel que Mon serviteur s'attend à ce que Je sois\". Le sens est que le pardon et l'acceptation du repentir par le Tout-Puissant sont soumis à la croyance sincère de Son serviteur qu'Il est Pardonneur et Miséricordieux. Cependant, ne pas accompagner cette croyance d'une bonne action serait se moquer du Tout-Puissant.\n\nC'est ce qu'a rapporté al-Buhkari (également par Muslim, at-Tirmidhi et Ibn-Majah).",
                  "arabic_text": "\"يَقُولُ اللَّهُ تَعَالَى: أَنَا عِنْدَ ظَنِّ عَبْدِي بِي، وَأَنَا مَعَهُ إِذَا ذَكَرَنِي، فَإِنْ ذَكَرَنِي فِي نَفْسِهِ، ذَكَرْتُهُ فِي نَفْسِي، وَإِنْ ذَكَرَنِي فِي مَلَإٍ، ذَكَرْتُهُ فِي مَلَإٍ خَيْرٍ مِنْهُمْ، وَإِنْ تَقَرَّبَ إِلَيَّ بِشِبْرٍ، تَقَرَّبْتُ إِلَيْهِ ذِرَاعًا، وَإِنْ تَقَرَّبَ إِلَيَّ ذِرَاعًا، تَقَرَّبْتُ إِلَيْهِ بَاعًا(1) وَإِنْ أَتَانِي يَمْشِي، أَتَيْتُهُ هَرْوَلَةً\"",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 15, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 16, 40 Hadith Qudsi",
                  "narrator": "D'après le fils d'Abbas (qu'Allah les agrée tous deux), le Messager d'Allah (ﷺ) a rapporté parmi les paroles qu'il a rapportées de son Seigneur (glorifié et exalté soit-Il) :",
                  "english_text": "Allah a inscrit les bonnes actions et les mauvaises. Puis Il a expliqué cela [en disant] : « Celui qui a l'intention de faire une bonne action et ne l'a pas faite, Allah l'inscrit auprès de Lui comme une bonne action complète. Mais s'il l'a voulue et l'a faite, Allah l'inscrit auprès de Lui comme dix bonnes actions jusqu'à sept cents fois, ou plusieurs fois. Mais s'il a l'intention de faire une mauvaise action et ne l'a pas faite, Allah l'inscrit auprès de Lui comme une bonne action complète. Mais s'il l'a voulue et l'a faite, Allah l'inscrit auprès de Lui comme une mauvaise action unique. »\n\nRapporté par al-Boukhari et Mouslim.",
                  "arabic_text": "\"إِنَّ اللَّهَ كَتَبَ الْحَسَنَاتِ وَالسَّيِّئَاتِ، ثُمَّ بَيَّنَ ذَلِكَ: فَمَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا، كَتَبَهَا اللَّهُ لَهُ عِنْدَهُ حَسَنَةً كَامِلَةً، فَإِنْ هُوَ هَمَّ بِهَا فَعَمِلَهَا، كَتَبَهَا اللَّهُ لَهُ عِنْدَهُ عَشْرَ حَسَنَاتٍ، إِلَى سَبْعِمِائَةِ ضِعْفٍ، إِلَى أَضْعَافٍ كَثِيرَةٍ، وَمَنْ هَمَّ بِسَيِّئَةٍ فَلَمْ يَعْمَلْهَا، كَتَبَهَا اللَّهُ لَهُ عِنْدَهُ حَسَنَةً كَامِلَةً، فَإِنْ هُوَ هَمَّ بِهَا فَعَمِلَهَا، كَتَبَهَا اللَّهُ سَيِّئَةً وَاحِدَةً\"",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 16, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 17, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Dharr al-Ghifari (qu'Allah l'agrée), le Prophète (ﷺ) rapporte parmi les paroles qu'il rapporte de son Seigneur (qu'Il soit glorifié) qu'Il a dit :",
                  "english_text": "Ô Mes serviteurs, Je Me suis interdit l’oppression et Je l’ai interdite entre vous. Ne vous opprimez donc pas les uns les autres. Ô Mes serviteurs, vous êtes tous dans l’égarement, sauf ceux que J’ai guidés. Recherchez donc auprès de Moi la guidée et Je vous guiderai. Ô Mes serviteurs, vous avez tous faim, sauf ceux que J’ai nourris. Recherchez donc auprès de Moi la nourriture et Je vous nourrirai. Ô Mes serviteurs, vous êtes tous nus, sauf ceux que J’ai vêtus. Recherchez donc auprès de Moi la nourriture et Je vous habillerai. Ô Mes serviteurs, vous péchez nuit et jour, et Je pardonne tous les péchés. Recherchez donc auprès de Moi le pardon et Je vous pardonnerai. Ô Mes serviteurs, vous ne parviendrez pas à Me nuire pour Me nuire, et vous ne parviendrez pas à Me faire du bien pour Me faire du bien. Ô Mes serviteurs, si le premier d’entre vous et le dernier d’entre vous, l’un de vous, l’homme et le djinn, étaient aussi pieux que le cœur le plus pieux de l’un d’entre vous, cela n’augmenterait en rien Mon royaume. Ô Mes serviteurs, si le premier d'entre vous et le dernier d'entre vous, l'un de ...",
                  "arabic_text": "\" يَا عِبَادِي: إِنِّي حَرَّمْتُ الظُّلْمَ عَلَى نَفْسِي وَجَعَلْتُهُ بَيْنَكُمْ مُحَرَّمًا فَلَا تَظَالَمُوا. \nيَا عِبَادِي: كُلُّكُمْ ضَالٌّ إِلَّا مَنْ هَدَيْتُهُ فَاسْتَهْدُونِي أَهْدِكُمْ، يَا عِبَادِي: كُلُّكُمْ جَائِعٌ إِلَّا مَنْ أَطْعَمْتُهُ فَاسْتَطْعِمُونِي أُطْعِمْكُمْ، يَا عِبَادِي: كُلُّكُمْ عَارٍ إِلَّا مَنْ كَسَوْتُهُ فَاسْتَكْسُونِي أَكْسُكُمْ، يَا عِبَادِي: إِنَّكُمْ تُخْطِئُونَ بِاللَّيْلِ وَالنَّهَارِ، وَأَنَا أَغْفِرُ الذُّنُوبَ جَمِيعًا، فَاسْتَغْفِرُونِي أَغْفِرْ لَكُمْ. \nيَا عِبَادِي: إِنَّكُمْ لَنْ تَبْلُغُوا ضَرِّي فَتَضُرُّونِي، وَلَنْ تَبْلُغُوا نَفْعِي فَتَنْفَعُونِي، يَا عِبَادِي: لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوا عَلَى أَتْقَى قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ مَا زَادَ ذَلِكَ فِي مُلْكِي شَيْئًا، يَا عِبَادِي: لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوا عَلَى أَفْجَرِ قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ مَا نَقَصَ ذَلِكَ مِنْ مُلْكِي شَيْئًا، يَا عِبَادِي: لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ قَامُوا فِي صَعِيدٍ وَاحِدٍ فَسَأَلُونِي، فَأَعْطَيْتُ كُلَّ وَاحِدٍ مَسْأَلَتَهُ، مَا نَقَصَ ذَلِكَ مِمَّا عِنْدِي إِلَّا كَمَا يَنْقُصُ الْمِخْيَطُ إِذَا أُدْخِلَ الْبَحْرَ. \nيَا عِبَادِي: إِنَّمَا هِيَ أَعْمَالُكُمْ أُحْصِيهَا لَكُمْ، ثُمَّ أُوَفِّيكُمْ إِيَّاهَا، فَمَنْ وَجَدَ خَيْرًا فَلْيَحْمَدْ اللَّهَ، وَمَنْ وَجَدَ غَيْرَ ذَلِكَ فَلَا يَلُومَنَّ إِلَّا نَفْسَهُ\"",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 17, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 18, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit :",
                  "english_text": "Allah (puissant et sublime) dira le Jour de la Résurrection : \nÔ fils d’Adam, je suis tombé malade et tu ne M’as pas visité. Il dira : Ô Seigneur, et comment Te rendrais-je visite alors que Tu es le Seigneur de l’univers ? Il dira : Ne savais-tu pas que Mon serviteur Untel était tombé malade et que tu ne lui avais pas rendu visite ? Ne savais-tu pas que si tu lui avais rendu visite, tu M’aurais trouvé auprès de lui ? Ô fils d’Adam, je t’ai demandé à manger et tu ne M’as pas donné à manger. Il dira : Ô Seigneur, et comment Te donnerais-je à manger alors que Tu es le Seigneur de l’univers ? Il dira : Ne savais-tu pas que Mon serviteur Untel t’a demandé à manger et tu ne M’as pas donné à boire ? Ne savais-tu pas que si tu l’avais donné à manger, tu aurais certainement trouvé cela (la récompense pour cela) auprès de Moi ? Ô fils d’Adam, je t’ai demandé à boire et tu ne M’as pas donné à boire. Il dira : Ô Seigneur, comment Te donnerais-je à boire alors que Tu es le Seigneur de l’univers ? Il dira : Mon serviteur Untel t'a demandé de lui donner à boire et tu ne lui as pas donné à boire. Si tu lui avais donné à boire, tu aurais certainement trouvé cela auprès de Moi. \n\nRapporté par Muslim.",
                  "arabic_text": "\" إِنَّ اللَّهَ عَزَّ وَجَلَّ يَقُولُ يَوْمَ الْقِيَامَةِ: يَا ابْنَ آدَمَ، مَرِضْتُ فَلَمْ تَعُدْنِي(1) قَالَ: يَا رَبِّ كَيْفَ أَعُودُكَ وَأَنْتَ رَبُّ الْعَالَمِينَ؟ قَالَ: أَمَا عَلِمْتَ أَنَّ عَبْدِي فُلَانًا مَرِضَ فَلَمْ تَعُدْهُ؟ أَمَا عَلِمْتَ أَنَّكَ لَوْ عُدْتَهُ لَوَجَدْتَنِي عِنْدَهُ. يَا ابْنَ آدَمَ: اسْتَطْعَمْتُكَ فَلَمْ تُطْعِمْنِي، قَالَ: يَا رَبِّ وَكَيْفَ أُطْعِمُكَ وَأَنْتَ رَبُّ الْعَالَمِينَ؟ قَالَ: أَمَا عَلِمْتَ أَنَّهُ اسْتَطْعَمَكَ عَبْدِي فُلَانٌ فَلَمْ تُطْعِمْهُ؟ أَمَا عَلِمْتَ أَنَّكَ لَوْ أَطْعَمْتَهُ لَوَجَدْتَ ذَلِكَ عِنْدِي. يَا ابْنَ آدَمَ: اسْتَسْقَيْتُكَ فَلَمْ تَسْقِنِي، قَالَ: يَا رَبِّ كَيْفَ أَسْقِيكَ وَأَنْتَ رَبُّ الْعَالَمِينَ؟ قَالَ اسْتَسْقَاكَ عَبْدِي فُلَانٌ فَلَمْ تَسْقِهِ، أَمَا إِنَّكَ لَوْ سَقَيْتَهُ لَوَجَدْتَ ذَلِكَ عِنْدِي\"",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 18, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 19, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit :",
                  "english_text": "Allah (puissant et sublime) a dit :\nL'orgueil est mon manteau et la grandeur ma robe, et quiconque rivalise avec Moi dans l'un ou l'autre domaine, Je le jetterai dans le feu de l'Enfer.\n\nCe hadith a été rapporté par Abu Dawud (ainsi que par Ibn Majah et Ahmad) avec de solides sources d'autorité. Ce hadith apparaît également dans Muslim dans une autre version.",
                  "arabic_text": "\" قَالَ اللَّهُ عَزَّ وَجَلَّ: الْكِبْرِيَاءُ رِدَائِي، وَالْعَظَمَةُ إِزَارِي، فَمَنْ نَازَعَنِي وَاحِدًا مِنْهُمَا، قَذَفْتُهُ فِي النَّارِ\"",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 19, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 20, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit :",
                  "english_text": "Les portes du Paradis seront ouvertes les lundis et les jeudis, et tout serviteur [d'Allah] qui n'associe rien à Allah sera pardonné, sauf l'homme qui a une rancune contre son frère. [D'eux] il sera dit : Retardez ces deux-là jusqu'à ce qu'ils se réconcilient ; retardez ces deux-là jusqu'à ce qu'ils se réconcilient.\n\nRapporté par Muslim (ainsi que par Malik et Abu Dawud).",
                  "arabic_text": "\" تُفْتَحُ أَبْوَابُ الْجَنَّةِ يَوْمَ الِاثْنَيْنِ، وَيَوْمَ الْخَمِيسِ، فَيُغْفَرُ لِكُلِّ عَبْدٍ لَا يُشْرِكُ بِاللَّهِ شَيْئًا، إِلَّا رَجُلًا كَانَتْ بَيْنَهُ وَبَيْنَ أَخِيهِ شَحْنَاءُ، فَيُقَالُ: (1) أَنْظِرُوا (2) هَذَيْنِ حَتَّى يَصْطَلِحَا، أَنْظِرُوا هَذَيْنِ حَتَّى يَصْطَلِحَا، أَنْظِرُوا هَذَيْنِ حَتَّى يَصْطَلِحَا\"",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 20, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 21, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a rapporté qu'Allah le Tout-Puissant a dit :",
                  "english_text": "Il y a trois (1) personnes dont Je serai l'adversaire au Jour de la Résurrection : l'homme qui a donné sa parole par Moi et l'a violée ; l'homme qui a vendu un homme libre (2) et en a consommé le prix ; et l'homme qui a embauché un ouvrier, lui a exigé son dû en totalité et ne lui a pas donné son salaire.\n(1) c'est-à-dire les types d'hommes.\n(2) c'est-à-dire l'homme qui a réduit un autre en esclavage et l'a vendu.\n\nRapporté par al-Boukhari (également par Ibn Majah et Ahmad ibn Hanbal).",
                  "arabic_text": "\" قَالَ اللَّهُ تَعَالَى: ثَلَاثَةٌ أَنَا خَصْمُهُمْ يَوْمَ الْقِيَامَةِ: رَجُلٌ أَعْطَى بِي ثُمَّ غَدَرَ (1)، وَرَجُلٌ بَاعَ حُرًّا فَأَكَلَ ثَمَنَهُ، وَرَجُلٌ اسْتَأْجَرَ أَجِيرًا فَاسْتَوْفَى مِنْهُ وَلَمْ يُعْطِهِ أَجْرَهُ\"",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 21, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 22, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Sa'id (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit :",
                  "english_text": "Que nul d'entre vous ne se rabaisse. Ils dirent : « Ô Messager d'Allah, comment l'un d'entre nous pourrait-il se rabaisser ? » Il dit : « Il trouve une affaire concernant Allah sur laquelle il devrait parler, et il ne la dit pas. Alors Allah (puissant et sublime) lui dit le Jour de la Résurrection : « Qu'est-ce qui t'a empêché de dire quelque chose sur tel ou tel sujet ? » Il dit : « C'était par crainte des gens. » Puis Il dit : « C'est plutôt Moi que vous devriez craindre davantage. »\n\nRapporté par Ibn Majah avec une chaîne de sources sûre.",
                  "arabic_text": "\" لَا يَحْقِرْ أَحَدُكُمْ نَفْسَهُ، قَالُوا: يَا رَسُولَ اللَّهِ كَيْفَ يَحْقِرُ أَحَدُنَا نَفْسَهُ؟ قَالَ: يَرَى أَمْرَ الِلَّهِ عَلَيْهِ فِيهِ مَقَالٌ، ثُمَّ لَا يَقُولُ فِيهِ، فَيَقُولُ اللَّهُ عَزَّ وَجَلَّ لَهُ يَوْمَ الْقِيَامَةِ: مَا مَنَعَكَ أَنْ تَقُولَ فِي كَذَا وَكَذَا؟ فَيَقُولُ: خَشْيَةُ النَّاسِ، فَيَقُولُ: فَإِيَّايَ كُنْتَ أَحَقَّ أَنْ تَخْشَى\"",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 22, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 23, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit :",
                  "english_text": "Allah dira le Jour de la Résurrection :\nOù sont ceux qui s'aiment les uns les autres à cause de Ma gloire ? Aujourd'hui, Je leur donnerai de l'ombre sous Mon ombre, car c'est un jour où il n'y a pas d'ombre en dehors de Mon ombre.\n\nRapporté par al-Boukhari (et aussi par Malik).",
                  "arabic_text": "\"إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقُولُ يَوْمَ الْقِيَامَةِ: أَيْنَ الْمُتَحَابُّونَ بجَلَالِي؟ الْيَوْمَ أُظِلُّهُمْ فِي ظِلِّي يَوْمَ لَا ظِلَّ إِلَّا ظِلِّي\"",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 23, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 24, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit :",
                  "english_text": "Si Allah a aimé un serviteur, Il appelle Gabriel et dit : J'aime un tel, alors aimez-le. Il (le Prophète) dit : Alors Gabriel l'aime. Puis il (Gabriel) appelle du ciel, en disant : Allah aime un tel, alors aimez-le. Et les habitants du ciel l'aiment. Il (le Prophète) dit : Alors l'acceptation lui est établie sur terre. Et si Allah a détesté un serviteur, Il appelle Gabriel et dit : J'ai détesté un tel, alors détestez-le. Alors Gabriel le détesta. Alors Gabriel appelle les habitants du ciel : Allah a détesté un tel, alors détestez-le. Il (le Prophète) dit : Alors ils le détestèrent, et l'aversion lui est établie sur terre. \n\nRapporté par Muslim (ainsi que par al-Bukhari, Malik et at-Tirmidhi).",
                  "arabic_text": "\" إِنَّ اللَّهَ إِذَا أَحَبَّ عَبْدًا دَعَا جِبْرِيلَ، فَقَالَ: إِنِّي أُحِبُّ فُلَانًا فَأَحِبَّهُ، قَالَ: فَيُحِبُّهُ جِبْرِيلُ، ثُمَّ يُنَادِي فِي السَّمَاءِ فَيَقُولُ: إِنَّ اللَّهَ يُحِبُّ فُلَانًا فَأَحِبُّوهُ، فَيُحِبُّهُ أَهْلُ السَّمَاءِ، قَالَ: ثُمَّ يُوضَعُ لَهُ الْقَبُولُ فِي الْأَرْضِ. وَإِذَا اللَّهُ أَبْغَضَ عَبْدًا، دَعَا جِبْرِيلَ فَيَقُولُ: إِنِّي أُبْغِضُ فُلَانًا فَأَبْغِضْهُ، فَيُبْغِضُهُ جِبْرِيلُ ثُمَّ يُنَادِي فِي أَهْلِ السَّمَاءِ: إِنَّ اللَّهَ يُبْغِضُ فُلَانًا فَأَبْغِضُوهُ، قَالَ: فَيُبْغِضُونَهُ، ثُمَّ تُوضَعُ لَهُ الْبَغْضَاءُ فِي الْأَرْضِ\"",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 24, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 25, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit :",
                  "english_text": "Allah (puissant et sublime) a dit :\nQuiconque se montre hostile à quelqu'un qui Me voue un culte, Je lui ferai la guerre. Mon serviteur ne se rapproche de Moi que par les devoirs religieux que Je lui ai prescrits. Et Mon serviteur se rapproche de Moi par des actes surérogatoires afin que Je l'aime. Quand Je l'aime, Je suis son ouïe avec laquelle il entend, sa vue avec laquelle il voit, sa main avec laquelle il frappe et son pied avec lequel il marche. S'il Me demandait quelque chose, Je le lui donnerais certainement, et s'il Me demandait refuge, Je le lui accorderais certainement. Je n'hésite pas à propos de quoi que ce soit autant que J'hésite à saisir l'âme de Mon fidèle serviteur : il déteste la mort et Je déteste lui faire du mal.\n\nRapporté par al-Boukhari.",
                  "arabic_text": "\" إِنَّ اللَّهَ عَزَّ وَجَلَّ قَالَ: مَنْ عَادَى لِي وَلِيًّا، فَقَدْ آذَنْتُهُ بِالْحَرْبِ، وَمَا تَقَرَّبَ إِلَيَّ عَبْدِي بِشَيْءٍ أَحَبَّ إِلَيَّ مِمَّا افْتَرَضْتُ عَلَيْهِ، وَمَا يَزَالُ عَبْدِي يَتَقَرَّبُ إِلَيَّ بِالنَّوَافِلِ حَتَّى أُحِبَّهُ، فَإِذَا أَحْبَبْتُهُ، كُنْتُ سَمْعَهُ الَّذِي يَسْمَعُ بِهِ، وَبَصَرَهُ الَّذِي يُبْصِرُ بِهِ، وَيَدَهُ الَّتِي يَبْطِشُ بِهَا، وَرِجْلَهُ الَّتِي يَمْشِي بِهَا، وَإِنْ سَأَلَنِي لَأُعْطِيَنَّهُ، وَلَئِنْ اسْتَعَاذَنِي لَأُعِيذَنَّهُ، وَمَا تَرَدَّدْتُ عَنْ شَيْءٍ أَنَا فَاعِلُهُ تَرَدُّدِي عَنْ نَفْسِ عَبْدِي الْمُؤْمِنِ، يَكْرَهُ الْمَوْتَ وَأَنَا أَكْرَهُ مَسَاءَتَهُ\"",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 25, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 26, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Umamah (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit :",
                  "english_text": "Allah (puissant et sublime) a dit : \nEn vérité, parmi ceux qui Me sont dévoués, celui que Je favorise le plus est le croyant qui a de faibles moyens et qui est très pratiquant dans la prière, qui est scrupuleux dans l'adoration de son Seigneur et qui Lui obéit intérieurement1, qui est discret parmi les gens et qui n'est pas remarqué, et dont la subsistance suffit à peine à lui permettre de subvenir à ses besoins, mais qui supporte cela avec patience. Alors le Prophète (ﷺ) lui serra la main et dit : La mort l'atteindra tôt, ses pleureurs seront peu nombreux, ses biens seront maigres. \n\n1 c'est-à-dire qu'il n'aura pas été ostentatoire dans son obéissance. \n\nRapporté par at-Tirmidhi (également par Ahmad ibn Hanbal et Ibn Majah). Sa chaîne d'autorités est fiable.",
                  "arabic_text": "عَنْ أَبي أُمامةَ رَضِيَ اللهُ عَنْهُ عَن النَّبِيّ صَلَّى الله عَلَيْهِ وَ سَلَّمَ قَالَ  \nقَالَ اللهُ عَزَّ وَجَلَّ :  إِنَّ أَغْبَطَ أَوْلِيَائي عِنْدِي لَمُوْمِنُ خَفِيفُ الخَاذِ ذُو حَظِّ مِنَ الصَّلاةِ أَحْسَنَ عِبَادَتَ رَبِّهِ وَ أَطَاعَهُ فِي السَّرِّ وَ كَانَ غَامِضًا فِي النَّاسِ لا يُشارُ إِلَيْهِ بِالأَصابِعِ وَ كَانَ رِزْقُهُ كفافًا فَصَبَرَ عَلى ذَلِكَ  ثُمَّ نَفَضَ بِيَدِهِ  ثُمَّ قَالَ : عُجِّلَتْ مَنِيَّتُهُ قَلَّتْ بَواكِيهِ قَلَّ تُرَاثُهُ  \nرواه الترمذي  (وكذالك أحمد و ابن ماجه)  وإسنَاده حسن",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 26, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 27, 40 Hadith Qudsi",
                  "narrator": "D'après Masruq, qui a dit :",
                  "english_text": "FrançaisNous avons interrogé Abdullah (c'est-à-dire Ibn Masud) à propos de ce verset : Et ne considérez pas comme morts ceux qui ont été tués dans le sentier d'Allah, mais ils sont vivants auprès de leur Seigneur, bien nourris (Coran, chapitre 3, verset 169). Il a dit : Nous avons interrogé à ce sujet et le Prophète (saw) a dit : Leurs âmes sont dans les entrailles d'oiseaux verts portant des lanternes suspendues au Trône, errant librement dans le Paradis où ils veulent, puis s'abritant dans ces lanternes. Alors leur Seigneur jeta un regard sur eux (1) et dit : Souhaitez-vous quelque chose ? Ils dirent : Que souhaiterions-nous alors que nous errons librement dans le Paradis où nous voulons ? Et ainsi leur fit-Il trois fois. Lorsqu'ils dirent qu'ils ne seraient pas épargnés d'être interrogés [à nouveau], ils dirent : Ô Seigneur, nous voudrions que Tu remettes nos âmes dans nos corps afin que nous puissions combattre pour Toi une fois de plus. Et lorsqu'Il vit qu'ils n'avaient besoin de rien, ils furent laissés tranquilles. (1) c'est-à-dire contre ceux qui ont été tués dans la cause d'Allah.\n\nRapporté par Muslim (ainsi que par at-Tirmidhi, an-Nasa'i et Ibn Majah).",
                  "arabic_text": "عَنْ مَسْرُوقٍ . قَالَ :  \n  \nسَأَلْنَا ـ أَوْ سَأَلْتُ عَبْدَاللهِ (أَيْ ابْنَ مَسْعُودٍ ) عَنْ هَذِهِ الايةِ : \n: ولَا تَحْسَبَنَّ الَّذِينَ قُتِلُوا في سَبِيلِ اللهِ أَمْواتاً بَلْ أَحْياءُ عِنْدَ رَبِّهِمْ يُرْزَقُونَ )) ـ قَالَ : أَمَا إِنَّا قَدْ سَأَلْنَا عَنْ ذَلِكَ ، فَقَالَ))\nأَرْواحُهُمْ في جَوْفِ طَيْرٍ خُضْرٍ ، لَهَا قَنَادِيلُ مُعَلَّقَةٌ بِالعَرْشِ ، تَسْرَحُ مِنَ الجَنَّةِ حَيْثُ شَاءَتْ ، ثُمَّ َ تَأْوِي إِلي تِلْكَ القَنَادِيلِ ، فَأَطَّلَعَ إِلَيْهِمْ رَبُّهُمْ اطِّلَاعَةً فَقَالَ : هَلْ تَشْتَهُونَ شَيْئاً ؟ قَالُوا : أَيَّ شَيْءٍ نَشْتَهِي ، وَ نَحْنُ نَسْرَحُ مِنَ الجَنَّةِ حَيْثُ شِئْنا ؟ فَفَعَلَ ذَلِكَ بِهِمْ ثَلَاثََ مَرَّاتٍ ، فَلَمَّا رَأَوْا أَنَّهُمْ لَنْ يُتْرَكُوا مِنْ أَنْ يُسْأَلُوا ، قَالُوا : يَا رَبِّ ، نُرِيْدُ أَنْ تَرُدَّ أَرْوَاحَنَا في أَجْسَادِنَا ؛ حَتَّى نُقْتَلَ في سَبِيلِكَ مَرَّةً أُخْرَي . فَلَمَّا رَأَى أَنْ لَيْسَ لَهُمْ حَاجَةٌ تُرِكُوا . \n  \n(رواهُ مسلم (وكذلك الترمذي والنسائي وابن ماجه",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 27, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 28, 40 Hadith Qudsi",
                  "narrator": "D'après Jundub ibn Abdullah (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit :",
                  "english_text": "Parmi ceux qui ont vécu avant vous, il y avait un homme qui avait une blessure. Il était tellement affligé qu'il prit un couteau et s'en servit pour faire une entaille dans la main, et le sang ne cessa de couler jusqu'à ce qu'il meure. Allah Tout-Puissant dit : « Mon serviteur M'a devancé ; Je lui ai interdit le Paradis. »\n\nRapporté par al-Boukhari.",
                  "arabic_text": ":عَنْ جُنْدُبٍ بِن عَبْدِاللهِ رَضِيَ اللهُ عَنْهُ قَالَ : رَسُولُ اللهِ  صَلَّى الله عَلَيْهِ وَ سَلَّمَ  \n \nكَانَ فِيمَنْ كَانَ قَبْلَكُمْ رَجُلٌ  بِهِ جُرْحٌ  فَجَزِعَ فَأَخَذَ سِكِّينًا فَحَزَّ بِهَا يَدَهُ فَمَا رقَأَ الدَّمُ  حَتَّى ماتَ قَالَ اللهُ تَعَالَى : بَادَرَنِي عَبْدِي بِنَفْسِهِ حَرَّمْتُ عَلَيْهِ الجَنَّةَ \nرواه البخاري",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 28, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 29, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit :",
                  "english_text": "Allah (puissant et sublime) dit :\nLa récompense de Mon fidèle serviteur, si J'ai pris pour Moi son meilleur ami parmi les habitants de la terre et qu'il l'a ensuite supporté patiemment par amour pour Moi, ne sera rien de moins que le Paradis.\n\nRapporté par al-Boukhari.",
                  "arabic_text": ": عَنْ أبي هرَيرَةَ رَضِيَ اللهُ عَنْهُ أَنَّ رَسُولَ اللهِ  صَلَّى الله عَلَيْهِ وَ سَلَّمَ قَالَ \n \n يَقُولُ اللهُ تَعَالَى : مَا لِعَبْدِي المُؤْمِنِ عِنْدِي جَزَاءٌ، إِذا قَبَضْتُ صَفِيَّهُ، مِنْ أَهلِ الدُّنْيَا، ثُمَّ احْتَسبَهُ، إِلَّا الجَنَّةَ\nرواه البخاري",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 29, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 30, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit :",
                  "english_text": "Allah (puissant et sublime) a dit :\nSi Mon serviteur aime Me rencontrer, J'aime le rencontrer ; et s'il n'aime pas Me rencontrer, Je n'aime pas le rencontrer. Explication prophétique de ce hadith sacré : Celui qui aime rencontrer Allah, Allah aime le rencontrer ; et celui qui n'aime pas rencontrer Allah, Allah n'aime pas le rencontrer. Aïcha (qu'Allah l'agrée) a dit : Ô Prophète d'Allah, est-ce à cause de l'aversion pour la mort, car nous détestons tous la mort ? Le Prophète (saw) a dit : Il n'en est pas ainsi, mais c'est plutôt que lorsque le croyant apprend la nouvelle de la miséricorde d'Allah, de Son agrément et de Son paradis, il aime rencontrer Allah et Allah aime le rencontrer ; mais lorsque le mécréant apprend la nouvelle du châtiment d'Allah et de Son mécontentement, il n'aime pas rencontrer Allah et Allah n'aime pas le rencontrer.\n\nRapporté par al-Boukhari et Malik. La version prophétique est rapportée par Muslim.",
                  "arabic_text": ":عَنْ أَبي هُرَيْرَةَ ،  رَضِيَ اللهُ عَنْهُ ،  أَنَّ رَسُولَ اللهِ ، صَلَّى الله عَلَيْهِ وَ سَلَّمَ ، قَالَ\n. قَالَ اللهُ عَزَّ وَجَلَّ : إِذا أَحَبَّ عَبْدِي لِقَائي ،  أَحْبَبْتُ لِقَاءَهُ ، وإِذا كَرِهَ لِقَائي ، كَرِهْتُ لِقَاءَهُ \n.رواه البخاري و مالك\nو في رواية مسلم ، توضح معنى الحديث : \n: عَنْ عَائِشَةَ ، رَضِيَ اللهُ عَنْهَا ، قَالَتْ : قَالَ رَسُولُ اللهِ ، صَلَّى اللهُ عَلَيْهِ وسَلَّمَ\nمَنْ أَحَبَّ لِقَاءَ اللهِ ، أَحَبَّ اللهُ لِقَاءَهُ ، وَ مَنْ كَرِهَ لِقَاءَ اللهِ ، كَرِهَ اللهُ لِقَاءَهُ . فَقُلْتُ : يَا نَبِيَّ اللهِ ، أَكَراهِيةَ المَوْتِ ؟ فَكُلُّنَا نَكْرَهُ المَوْتَ . قَالَ لَيْسَ كَذَلِكَ ، وَلَكِنَّ المُؤْمِنَ إذا بُشِّرَ  بِرَحْمةِ اللهِ وَ رِضْوَانِهِ وَجَنَّتِهِ ، أَحَبَّ لِقَاءَ اللهِ ، فَأَحَبَّ اللهُ لِقَاءَهُ ، وَإِنَّ الكَافِرَ إِذا بُشِّرَ بِعَذَابِ اللهِ وَسَخَطِهِ ، كَرِهَ لِقَاءَاللهِ ، وَكَرِهَ اللهُ لِقاءَهُ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 30, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 31, 40 Hadith Qudsi",
                  "narrator": "D'après Jundub (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a rapporté :",
                  "english_text": "Un homme dit : « Par Allah, Allah ne pardonnera pas à Untel. » Allah Tout-Puissant dit alors : « Qui est celui qui jure par Moi que Je ne pardonnerai pas à Untel ? En vérité, J'ai pardonné à Untel et j'ai annulé tes [propres] bonnes actions (1) » (ou comme il l'a dit). \n(1) Un hadith similaire, rapporté par Abu Dawud, indique que la personne en question était un homme d'or dont les bonnes actions antérieures ont été réduites à néant par la prétention de déclarer qu'Allah ne pardonnerait pas les mauvaises actions de quelqu'un. \n\nIl a été rapporté par Muslim.",
                  "arabic_text": "عَنْ جُنْدُبٍ رَضِيَ اللهُ عَنْهُ : أَنَّ رَسُولَ اللهِ  صَلَّى الله عَلَيْهِ وَ سَلَّمَ حَدَّثَ \n \n  (أَنْ رجُلاً قال : واللهِ لا يَغْفِرُ اللهُ لِفُلانٍ وإِنَّ اللهَ تَعَالَى قَالَ : مَنْ ذَا الَّذِي يَتَأَلَّى عَلَيَّ أَنْ لا أَغْفِرَ لِفُلان،فَإِنِّي قَدْ غَفَرْتُ لِفُلانٍ، وأَحْبَطْتُ عَمَلَكَ (أَوْ كَمَا قَال \nرواه مسلم",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 31, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 32, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit :",
                  "english_text": "Un homme commit un grand péché contre lui-même. Lorsque la mort l'atteignit, il ordonna à ses fils de dire : « Quand je serai mort, brûlez-moi, puis écrasez-moi et dispersez mes cendres dans la mer. Car, par Allah, si mon Seigneur s'empare de moi, Il me punira comme Il n'a puni personne. » C'est ce qu'ils lui firent. Puis Il dit à la terre : « Produis ce que tu as pris. » Et il était là. Et Il lui dit : « Qu'est-ce qui t'a poussé à faire ce que tu as fait ? » Il dit : « Par crainte de Toi, ô mon Seigneur » (ou il dit : « Par crainte de Toi ») et à cause de cela Il lui pardonna. \n\nRapporté par Muslim (ainsi que par al-Bukhari, an-Nasa'i et Ibn Majah).",
                  "arabic_text": "عَنْ أَبي هُرَيْرَةَ ،  رَضِيَ اللهُ عَنْهُ ،  عَنِ النَّبَيِّ  صَلَّى الله عَلَيْهِ وَ سَلَّمَ ، قَالَ :  \n  \nأَسْرَفَ رَجُلٌ عَلي نَفْسِهِ ، فَلَمَّا حَضَرَهُ المَوْتُ أَوْصَى بَنِيه ، فَقَالَ : إِذَا أَنَا مِتُّ فَأَحْرِقُوني ، ثُمَّ اسْحَقُوني ، ثُمَّ أَذْرُوني في البَحْرِ فَوَاللهِ لَئِنْ قَدَرَ عَلَيَّ رَبِّي لَيُعَذَّبَنِّي عَذَاباً ، مَا عَذَّبَهُ أَحَداً ، فَفَعَلُوا ذَلِكَ بِهِ . فَقَالَ لِلْأَرْضِ : أَدِّي مَا أَخَذْتِ ، فَإِذا هُوَ قَائِمٌ ، فَقَالَ لَهُ : مَا حَمَلَكَ عَلَي مَا صَنَعْتَ ؟ قَالَ : خَشْيَتُكَ يَا رَبِّ ، أَوْ مَخَافَتُكَ . فَغَفَرَ لَهُ بِذَلِكَ . \n  \nرواهُ مسلم (وكذلك البخاري والنسائي وابن ماجه)",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 32, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 33, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), parmi les choses qu'il rapporte de son Seigneur (puissant et sublime), le Prophète (ﷺ) a dit :",
                  "english_text": "Un serviteur [d'Allah] a commis un péché et a dit : Ô Allah, pardonne-moi mon péché. Et Il (glorifié et exalté soit-Il) a dit : Mon serviteur a commis un péché et a su qu'il avait un Seigneur qui pardonne les péchés et les punit. Puis il a péché de nouveau et a dit : Ô Seigneur, pardonne-moi mon péché. Et Il (glorifié et exalté soit-Il) a dit : Mon serviteur a commis un péché et a su qu'il avait un Seigneur qui pardonne les péchés et les punit. Puis il a péché de nouveau et a dit : Ô Seigneur, pardonne-moi mon péché. Et Il (glorifié et exalté soit-Il) a dit : Mon serviteur a commis un péché et a su qu'il avait un Seigneur qui pardonne les péchés et les punit. Fais ce que tu veux, car je t'ai pardonné.\n\nRapporté par Muslim (et aussi par al-Bukhari).",
                  "arabic_text": "عَنْ أَبي هُرَيْرَةَ ،  رَضِيَ اللهُ عَنْهُ ،  عَنِ النَّبَيِّ  صَلَّى الله عَلَيْهِ وَ سَلَّمَ ، فِيما يَحْكِي عَنْ رَبِّهِ عَزَّ وَجَلَّ ، قَالَ    :  \n  \nأَذْنَبَ عَبْدٌ ذَنْبًا ، فَقَالَ : اللَّهُمَّ اغْفِرْ لِي ذَنْبي . فَقَالَ تَبَارَكَ وَتَعَالى : أَذْنَبَ عَبْدِي ذَنْبًا ، فَعَلِمَ أنَّ لَهُ رَبّاً ، يَغْفِرُ الذَّنْبَ ، وَيَأْخُذُ بِهِ . ثُمَّ عَادَ فَأَذْنَبَ ، فَقَالَ : أَيّ رَبِّ ، اغْفِرْ لِي ذَنْبِِي ، فَقَالَ تَبَارَكَ وتَعَالى : عَبْدِي أَذْنَبَ ذَنْباً . فَعَلِمَ أَنَّ لَهُ رَبّاً يَغْفِرُ الذَّنْبَ ، ويَأْخُذُ بِهِ . ثُمَّ عَادَ فَأَذْنَبَ ، فَقَالَ : أَيّ رَبِّ ، اغْفِرْ لِي ذَنْبِي : فَقَالَ تَبَارَكَ وَتَعَالَى : أَذْنَبَ عَبْدِي ذَنْباً ، فَعَلِمَ أَنَّ لَهُ رَبّاً ، يَغْفِرُ الذَّنْبَ ، ويَأْخُذُ بالذَّنْبِ . اعْمَلْ مَا شِئْتَ ، فَقَدْ غَفَرْتُ لَكَ .  \n  \nرواهُ مسلم (وكذلك البخاري)",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 33, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 34, 40 Hadith Qudsi",
                  "narrator": "D'après Anas (qu'Allah l'agrée) qui a dit :",
                  "english_text": "J'ai entendu le Messager d'Allah (ﷺ) dire : Allah le Tout-Puissant a dit :\nÔ fils d'Adam, aussi longtemps que tu M'invoqueras et Me demanderas pardon, Je te pardonnerai ce que tu as fait, et Je ne t'en voudrai pas. Ô fils d'Adam, si tes péchés atteignaient les nuages ​​du ciel et si tu Me demandais pardon, Je te pardonnerais. Ô fils d'Adam, si tu venais à Moi avec des péchés presque aussi grands que la terre et si tu te présentais à Moi sans M'attribuer aucun associé, Je t'accorderais un pardon presque aussi grand.\n\nRapporté par at-Tirmidhi (et aussi par Ahmad ibn Hanbal). Sa chaîne d'autorité est fiable.",
                  "arabic_text": "عَنْ أَنَسٍ رَضِيَ اللهُ عَنْهُ ،  قَالَ : سَمِعْتُ  رَسُولَ اللهِ  صَلَّى الله عَلَيْهِ وَ سَلَّمَ ، يَقُولُ :  \n  \nقَالَ اللهُ تَعَالَى : يَا ابْنَ ادَمَ ، إِنَّكَ مَا دَعَوْتََنِي وَرَجَوْتَنِي ، غَفَرْتُ لَكَ عَلَى مَا كَانَ مِنْكَ وَلَا أُبالِي . يا ابْنَ ادَمَ  :لَوْ بَلَغَتْ ذُنُوبُكَ عَنانَ السَّماءِ ثُم َّ اسْتَغْفَرْتَني ، غَفَرْتُ لَكَ . يَا ابْنَ ادَمَ : إِنَّكَ لَوْ أَتَيْتَنِي بِقُرَابِ الأَرْضِ خَطَايا ثُمَّ لَقِيتَني لَا تُشْرِكُ بِي شَيْأً ، لَأَتيْتُكَ بِقُرَابِها مَغْفِرَةً \n    \nرواهُ الترمذي (وكذلك أحمد) وسنده حسن",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 34, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 35, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit :",
                  "english_text": "Notre Seigneur (glorifié et exalté soit-Il) descend chaque nuit au ciel de la terre au dernier tiers de la nuit, et Il dit : « Qui M'adresse une prière pour que je l'exauce ? Qui Me demande quelque chose pour que je le lui accorde ? Qui Me demande pardon pour que je lui pardonne ? »\n\nRapporté par al-Boukhari (également par Mouslim, Malik, at-Tirmidhi et Abu Dawud). Dans une version de Mouslim, le hadith se termine par les mots : « Et ainsi Il continue jusqu'à ce que l'aube brille. »",
                  "arabic_text": "عَنْ أَبي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ  أَنَّ رَسُولَ اللهِ  صَلَّى الله عَلَيْهِ وَ سَلَّمَ قَالَ \n   \nيَتنزَّلُ رَبُّنَا ، تَبَارَكَ وَتَعَالَى ، كُلَّ لَيْلَةٍ إلي سَمَاءِ الدُّنْيا ، حينَ يَبْقَى ثُلُثُ اللَّيْلِ الاخِرُ ، فَيَقُولُ  مَنْ يَدْعُوني فأَسْتَجِيبَ لَه ؟ مَنْ يَسْأَلُني فَأُعْطِيَهُ ؟ مَنْ يَسْتَغْفِرُني فَأَغْفِرَلَهُ ؟ \n     \n رواه البخاري (وكذلك مسلم ومالك والترمذي و أبو داود) \nوفي رواية لمسلم زيادة: \nفَلا يَزالُ كذَلِك حَتَى يُضِيءَ الفَجْرُ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 35, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 36, 40 Hadith Qudsi",
                  "narrator": "D'après Anas (qu'Allah l'agrée), le Prophète (ﷺ) a dit :",
                  "english_text": "FrançaisLes croyants se rassembleront le Jour de la Résurrection et diront : « Ne devrions-nous pas demander à [quelqu'un] d'intercéder pour nous auprès de notre Seigneur ? » Ils viendront donc à Adam et diront : « Tu es le Père de l'humanité ; Allah t'a créé de Sa main, Il a fait se prosterner Ses anges devant toi et Il t'a enseigné les noms de toute chose. Intercède donc pour nous auprès de ton Seigneur afin qu'Il nous accorde le soulagement de cet endroit où nous sommes. » Et il dira : « Je ne suis pas en mesure [de le faire] » - et il évoquera son méfait et aura honte et dira : « Va vers Noé, car il est le premier messager qu'Allah a envoyé aux habitants de la terre. » Ils viendront donc à lui et il dira : « Je ne suis pas en mesure [de le faire] » - et il évoquera sa demande à son Seigneur d'une chose dont il n'avait aucune connaissance (Coran Chapitre 11 Versets 45-46), et il aura honte et dira : « Va vers l'Ami du Miséricordieux (Abraham). FrançaisAlors ils viendront à lui et il dira : Je ne suis pas en mesure [de faire cela]. Va vers Moïse, un serviteur à qui Allah a parlé et à qui Il a donné la Thora. Alors ils viendront à lui et il dira : Je ne suis pas en mesure [de faire cela]. Et il mentionnera le fait de prendre une vie autrement que pour une vie (Coran Chapitre 28 Versets 15-16), et il aura honte auprès de son Seigneur et dira : Va vers Jésus, le serviteur et le messager d'Allah, la parole et l'esprit d'Allah. Alors ils viendront à lui et il dira : Je ne suis pas en mesure [de faire cela]. Va vers Muhammad (sur lui la bénédiction et la paix), un serviteur à qui Allah a pardonné tous ses méfaits, passés et futurs. Alors ils viendront à moi et je me mettrai en route pour demander la permission d'aller vers mon Seigneur, et la permission me sera accordée, et lorsque je verrai mon Seigneur, je me prosternerai. Il me laissera ainsi pour le temps qu'il Lui plaira, puis il [me] dira : Lève la tête, demande et elle sera accordée, parle et elle sera entendue, intercède et ton intercession sera acceptée. Je lèverai donc la tête et Le louerai d'une forme de louange qu'Il m'enseignera. Alors j'intercéderai et Il me fixera une limite [quant au nombre de personnes], alors je les ferai entrer au Paradis. Puis je retournerai à Lui, et quand je verrai mon Seigneur [je me prosternerai] comme auparavant. Alors j'intercéderai et Il me fixera une limite [quant au nombre de personnes]. Alors je les ferai entrer au Paradis. Puis je reviendrai une troisième fois, puis une quatrième, et je dirai : Ne restent dans l'Enfer que ceux que le Coran a enfermés et qui doivent y être pour l'éternité. Sortira de l'Enfer celui qui a dit : Il n'y a pas de dieu à part Allah et qui a dans son cœur une bonté pesant un grain d'orge, Alors sortira de l'Enfer celui qui a dit : \"Pas de divinité à part Allah\" et qui a dans son cœur une bonté pesant un grain de blé ; alors sortira de l'Enfer celui qui a dit : \"Pas de divinité à part Allah\" et qui a dans son cœur une bonté pesant un atome.\n\nRapporté par al-Boukhari (également par Muslim, at-Tirmidhi et Ibn Majah).",
                  "arabic_text": "عَنْ أَنَسٍ ،  رَضِيَ اللهُ عَنْهُ ، عَنِ النَّبِيِّ صَلَّى الله عَلَيْهِ وَ سَلَّمَ ، قَالَ \nيَجْتَمِعُ المُؤْمِنُونَ يَوْمَ القِيَامَةِ فَيَقُولُونَ : لَوِ اسْتَشْفَعْنَا إلى رَبِّنَا ، فَيَأْتُونَ ادَمَ ، فَيَقُولُونَ : أَنْتَ أَبو النَّاسِ ، خَلَقَكَ اللهُ بِيَدِهِ ، وَأَسْجَدَ لَكَ مَلائِكَتَهُ ، وَعَلَّمَكَ أَسْماءَ كُلِّ شَيْءٍ ، فاشْفَعْ لَنا عِنْدَ رَبِّكَ ، حَتَّى يُرِيحَنا مِنْ مَكَانِنا هَذا ، فَيَقُولُ : لَسْتُ هُنَاكُمْ ـ وَيَذْكُرُ ذَنْبَهُ ، فَيَسْتَحْيي ـ ائْتُوا نُوحاً ؛ فَإِنَّهُ أَوَّلُ رَسُولٍ بَعَثَهُ اللهُ إِلي أَهْلِ الأَرْض ، فَيَأْتُونَهُ ، فَيَقُولُ : لَسْتُ هُنَاكُمْ ـ ويَذْكُرُ سُؤالَهُ رَبَّهُ مَا لَيْسَ لَهُ بِهِ عِلْمٌ ، فَيَسْتَحْيي ـ فَيَقُولُ : اؤْتُوا خَلِيلَ الرَّحْمنِ ، فَيَأْتُونَهُ ، فَيَقُولُ : لَسْتُ هُنَاكُم ،   اؤْتُوا موسى ، عَبْداً كَلَّمَهُ اللهُ ، و أَعْطَاهُ التَّوْرَاةَ . فَيَأْتُونَهُ ، فَيَقُولُ : لَسْتُ هُنَاكُمْ ـ وَيَذْكُرُ  قَتْلَ النَّفْسِ بِغَيْرِ نَفْسٍ ، فَيَسْتَحْيي مِنْ رَبِّهِ ـ فَيَقُولُ : اؤْتُوا عِيسَى ، عَبْدَ اللهِ وَرَسُولَهُ ، وَكَلِمَةَ اللهِ وَرُوحَهُ . فَيَأْتُونَهُ ، فَيَقُولُ : لَسْتُ هُنَاكُمْ ، اؤْتُوا مُحَمَّداً ، ـ صَلَّى الله عَلَيْهِ وَ سَلَّمَ ـ عَبْداً غَفَرَ اللهُ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَا تَأَخَّرَ ، فَيَأْتُونَنِي ، فَأَنْطَلِقُ حَتَّي أَسْتَأْذِنَ عَلَي رَبِّي فَيُؤْذَنُ . فإذا رَأَيْتُ رَبِّي وَقَعْتُ سَاجداً ، فَيَدَعُني مَا شَاءَ اللهُ ، ثُمَّ يُقَالُ : ارْفَعْ رَأْسَكَ ، وسَلْ تُعْطَهُ ، وَقُلْ يُسْمَعْ ، واشْفَعْ تُشَفَّعْ . فَأَرْفَعُ رَأْسي ، فَأَحْمَدُهُ بِتَحْمِيدٍ يُعَلِّمُنِيهِ ، ثُمَّ أَشْفَعُ ، فَيحُدُّ لي حَدّاً ، فَأُدْخِلُهُمْ الجَنَّةَ . ثُمَّ أَعُودُ إِلَيْهِ ، فإِذا رَأَيْتُ رَبِّي ( فَأَقَعُ ساجداً ) مِثْلَهُ ، ثُمَّ أَشْفَعُ فَيَحُدُّ لِي حَدّاً ، فَأُدْخِلُهُمُ الجَنَّةَ . ثُمَّ أَعُودُ الثالِثةَ ، ثُمَّ أَعُودُ الرَّابعة ، فَأقُولُ : مَا بَقِي في النَّارِ إِلَّا مَنْ حَبَسَهُ القُرْانُ ، ووَجَبَ عَلَيْهِ الخُلُودُ \nرواه البخاري ( وكذلك مسلم والترمذي وابن ماجه ) و في رواية أخرى للبخاري زيادة هي \nقَالَ النَّبِيُّ صَلَّى الله عَلَيْهِ وَ سَلَّمَ ، يَخْرُجُ مِنَ النَّارِ مَنْ قَالَ : لَا إِلهَ إِلَّا اللهُ ، وكَانَ فِي قَلْبِهِ مِنَ الخَيْرِ مَا يَزِنُ شَعِيرةً ، ثُمَّ يَخْرُجُ مِنَ النَّارِ مَنْ قَالَ : لَا إِلهَ إِلَّا اللهُ ، وكَانَ فِي قَلْبِهِ مِنَ الخَيْرِ مَا يَزِنُ بُرَّةً ، ثُمَّ يَخْرُجُ مِنَ النَّارِ مَنْ قَالَ : لَا إِلهَ إِلَّا اللهُ ، وكَانَ فِي قَلْبِهِ مَا يَزِنُ مِنَ الخَيْرِ ذَرَّةً",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 36, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 37, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit :",
                  "english_text": "Allah a dit :\nJ'ai préparé pour Mes serviteurs pieux ce qu'aucun œil n'a vu et aucune oreille n'a entendu, et cela n'est pas venu à l'esprit d'un cœur humain. Récitez donc si vous le souhaitez (1) : Et aucune âme ne sait quelle joie leur a été cachée (Coran, chapitre 32, verset 17).\n(1) Les mots \"Récitez donc si vous le souhaitez\" sont ceux d'Abu Harayrah.\n\nRapporté par al-Bukhari, Muslim, at-Tirmidhi et Ibn Majah.",
                  "arabic_text": "عَنْ أَبي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ : قَالَ رَسُولَ اللهِ  صَلَّى الله عَلَيْهِ وَ سَلَّمَ  \n   \nقَالَ اللهُ أَعْدَدْتُ لِعِبَادي الصَّالِحِينَ مَا لَا عَيْنٌ رَأَت وَ لَا أُذُنٌ سَمِعَتْ وَلَا خَطَرَ عَلَى قَلْبِ بَشَرٍ  فاقْرأُوا إنْ شِئْتُمْ : فَلَا تَعْلَمُ نَفْسٌ مَّا أُخْفِيَ لَهُمْ مِنْ قُرَّةِ أَعْيُنٍ   \n     \nرواه البخاري و مسلم والترمذي وابن ماجه",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 37, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 38, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit :",
                  "english_text": "Français Quand Allah créa le Paradis et l'Enfer, Il envoya Gabriel au Paradis en disant : Regarde-le et ce que j'y ai préparé pour ses habitants. Le Prophète (saw) dit : Il y alla et le regarda ainsi que ce qu'Allah y avait préparé pour ses habitants. Le Prophète (saw) dit : Il retourna donc vers Lui et dit : Par Ta Gloire, personne n'en entend parler sans y entrer. Il ordonna alors qu'il soit entouré de formes de difficultés, et Il dit : Retourne-y et regarde ce que j'y ai préparé pour ses habitants. Le Prophète (saw) dit : Il retourna donc vers Lui et trouva qu'il était entouré de formes de difficultés (1). Puis il retourna vers Lui et dit : Par Ta Gloire, je crains que personne n'y entre. Il dit : Va en Enfer et regarde-le et ce que j'y ai préparé pour ses habitants, et il trouva qu'il était en couches, les unes au-dessus des autres. Puis il retourna vers Lui et dit : Par Ta Gloire, personne qui en entend parler n'y entrera. Il ordonna alors qu'elle soit entourée de passions. Puis Il dit : « Retourne-y. » Il y retourna et dit : « Par Ta gloire, je crains que personne n'échappe à l'entrée en elle. » (1) Le mot arabe utilisé ici est « makarih », dont le sens littéral est « choses détestées ». Dans ce contexte, il fait référence aux formes de discipline religieuse que l'homme trouve généralement pénibles. \n\nCe hadith a été rapporté par Tirmidhi, qui a dit qu'il s'agissait d'un bon et solide hadith (également par Abu Dawud et an-Nasa'i).",
                  "arabic_text": "عَنْ أَبي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ  عَنْ رَسُول اللهِ  صَلَّى الله عَلَيْهِ وَ سَلَّمَ قَالَ \n   \nلَمَّا خَلَقَ اللهُ الجَنَّةَ وَالنَّارَ  أَرْسَلَ جِبْرِيْلَ إلى الجنَّةِ  فَقَالَ  انْظُرْ إِلَيْهَا وَإلى مَا أَعْدَدْتُ لأهْلِهَا فِيْهَا . قَالَ: فَجَاءَهَا وَنَظَرَ إِلَيْهَا وَ إِلى مَا أَعَدَّاللهُ  لأهْلِهَا فِيْهَا. قَالَ:  فَرَجَعَ إِلَيْهِ  قَالَ:  فَوَعِزَّتِكَ لَا يَسْمَعُ بِهَا أَحَدٌ إِلَّا دَخَلَهَا  فَأَمَرَ بِهَا فَحُفَّتْ بِالمَكَارِهِ  فَقَالَ:  ارْجِعْ إِلَيْهَا ، فَانْظُرْ إِلى مَا أَعْدَدْتُ لأَهْلِهَا فِيْهَا ، قَالَ:  فَرَجَعَ إِلَيْهَا ، فإِذا هِيَ قَدْ حُفَّتْ  بِالمَكَارِهِ ، فَرَجَعَ إِلَيْهِ ، فَقَالَ:  وَعِزَّتِكَ لَقَدْ خِفْتُ أَنْ لَا يَدْخُلَهَا أَحَدٌ قَالَ:  اذْهَبْ إِلى النَّارِ فَانْظُرْ إِليْها ، وإلى مَا أَعْدَدْتُ لأَهْلِها فِيْهَا . فإذا هِي يَرْكَبُ بَعْضُهَا بَعْضًا ، فَرَجَعَ إِلَيْهِ ، فَقَالَ:  وَ عِزَّتِكَ لَا يَسْمَعُ بِهَا أحَدٌ فَيَدْخُلَهَا . فَأَمَر بِها فَحُفَّتْ بِالشَّهَوَاتِ ، فَقَالَ:  ارْجِعْ إِلَيْهَا ، فَرَجَعَ إلَيْهَا ، فَقَالَ:  وَ عِزَّتِكَ لَقَدْ خَشِيتُ أنْ لَا يَنْجُوَ   مِنْهَا أَحَدٌ إِلَّا دَخَلَهَا \n     \n رواه الترمذي و قال حديث حسن صحيح و كذلك أبو داود والنسائي",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 38, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 39, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Sa'id al-Khoudri (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit :",
                  "english_text": "Le Paradis et l'Enfer se disputèrent, et l'Enfer dit : « En moi se trouvent les puissants et les orgueilleux. » Le Paradis dit : « En moi se trouvent les faibles et les pauvres. » Alors Allah jugea entre eux, [en disant] : « Tu es le Paradis, Ma miséricorde ; par toi Je fais miséricorde à ceux que Je veux. Et tu es l'Enfer, Mon châtiment ; par toi Je punis ceux que Je veux, et il M'incombe que chacun de vous soit rassasié. »\n\nRapporté par Muslim (ainsi que par al-Bukhari et at-Tirmidhi).",
                  "arabic_text": "عَنْ أَبي سَعيدٍ الْخُدْريّ رَضِيَ اللهُ عَنْهُ عَن النَّبِيّ صَلَّى الله عَلَيْهِ وَ سَلَّمَ قَالَ : احْتَجَّتِ الجَنَّةُ والنَّارُ فَقَالتِ النَّارُ : فِيَّ الجَبَّارونَ والمُتكَبَّرونَ  وَقَالتِ الجَنَّةُ : فِيّ ضُعَفاءُ النَّاسِ ومساكينُهُمْ  فَقَضَى اللهُ بَيْنَهُما : إِنَّكِ الجَنَّةُ رَحْمَتِي أَرْحَمُ بِكِ مَنْ أَشاءُ، وإنكِ النارُ عذابي ، أُعَذِبُ بِكِ من أشاءُ ،  وَلِكلَيْكُما عَلَيَّ مِلْؤُها\n(رواه مسلم  (وكذلك البخاري والترمذي",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 39, 40 Hadith Qudsi"
                    }
                  ]
                },
                {
                  "reference": "Hadith 40, 40 Hadith Qudsi",
                  "narrator": "D'après Abou Sa'id al-Khoudri (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit :",
                  "english_text": "Allah dira aux habitants du Paradis : Ô habitants du Paradis ! Ils diront : Ô notre Seigneur, nous nous présentons et nous sommes à Ta satisfaction, et le bien repose entre Tes mains. Puis Il dira : Êtes-vous satisfaits ? Et ils diront : Et comment ne serions-nous pas satisfaits, ô Seigneur, alors que Tu nous as donné ce que Tu n'as donné à aucune autre de Ta création ? Alors Il dira : Ne voudriez-vous pas que Je vous donne quelque chose de mieux que cela ? Et ils diront : Ô Seigneur, et qu'y a-t-il de mieux que cela ? Et Il dira : Je ferai descendre sur vous Ma grâce et par la suite je ne serai plus jamais mécontent de vous. \n\nRapporté par al-Boukhari (et aussi par Muslim et at-Tirmidhi).",
                  "arabic_text": "عَنْ أبي سَعِيدٍ الخُدّريّ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ النَّبِىُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ\n إنَّ اللهَ يَقُولُ لأَهْلِ الجَنَّةِ : يَا أهْلَ الجَنَّةِ . فَيَقُولُون : لَبَّيْكَ رَبَّنا وسَعْدَيْكَ ، والخَيْرُ في يَدَيْكَ. فَيَقُولُ : هَلْ رَضِيتُم ؟  فَيَقُولُونَ : وَما لَنا لَا نَرْضَىى يَا رَبّ ،  وَقَدْ أَعْطَيْتَنا مَا لمْ تُعْطِ أَحَداً مِنْ خَلْقِكَ .  فَيَقُولُ : أَلا أُعْطِيكُمْ أَفْضَلَ مِنْ ذَلِك ؟  فَيَقُولُونَ :  يَا رَبّ وأيُّ شيءٍ أَفْضَلُ مِنْ ذَلِك ؟ فَيَقُولُ : أٌحِلُّ عَلَيْكُمْ رِضْواني ، فَلا أَسْخَطُ عَلَيْكُمْ بَعْدَهُ أَبداً \nرواه البخاري (وكذلك مسلم والترمذي)",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 40, 40 Hadith Qudsi"
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "book_number": "",
          "english_book_name": "Quarante Hadith de Shah Waliullah Dehlawi",
          "arabic_book_name": "أربعون شاه ولي الله الدهلوي",
          "book_range": "1 to 40",
          "link": "https://sunnah.com/shahwaliullah40",
          "chapters_and_hadiths": [
            {
              "chapter_no": null,
              "chapter_title_english": "Hadiths orphelins",
              "chapter_title_arabic": null,
              "hadiths": [
                {
                  "reference": "Hadith 1, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "Le rapport n’est pas un témoignage.",
                  "arabic_text": "لَیْسَ الْخَبَرُ کَالْمُعَایَنَةِ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 1, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 2, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "La guerre est une tromperie.",
                  "arabic_text": "الْحَرْبُ خُدَعَةٌ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 2, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 3, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "Un musulman est le miroir du musulman.",
                  "arabic_text": "الْمُسْلِمُ مِرْآةُ الْمُسْلِمِ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 3, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 4, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "La personne dont on sollicite les conseils est en position de confiance.",
                  "arabic_text": "الْمُسْتَشَارُ مُؤتَمَنٌ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 4, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 5, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "La personne qui guide (quelqu'un) pour faire une bonne action est comme celui qui accomplit la bonne action.",
                  "arabic_text": "الدَّالُّ عَلَی الْخَیْرِ کَفَاعِلِهِ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 5, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 6, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "Demandez de l’aide pour tout besoin en toute discrétion.",
                  "arabic_text": "إِسْتَعِیْنُوْا عَلَی الْحَوَائِجِ بِالْکِتْمَانِ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 6, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 7, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "Protégez-vous du feu même avec une partie d'une datte.",
                  "arabic_text": "إِتَّقُوْا النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 7, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 8, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "Le monde est la prison du croyant et le paradis du mécréant.",
                  "arabic_text": "الدُّنْیَا سِجْنُ الْمُؤمِنِ وَ جَنَّةُ الْکَافِرِ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 8, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 9, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "La modestie est tout à fait bonne.",
                  "arabic_text": "الْحَیَاءُ خَیْرٌ کُلُّهُ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 9, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 10, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "La parole du croyant est comme une prise de main.",
                  "arabic_text": "عِدَةُ الْمُؤمِنِ کَاَخْذِ الْکَفِّ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 10, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 11, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "Il est interdit à un croyant de rompre les relations avec son frère pendant plus de trois jours.",
                  "arabic_text": "لَا یَحِلُّ لِمُؤمِنٍ اَنْ یَّجُهْرَ أخَاهُ فَوقَ ثَلَاثَةِ أیَّامٍ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 11, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 12, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "Celui qui nous trompe n’est pas l’un d’entre nous.",
                  "arabic_text": "لَیْسَ مِنَّا مَنْ غَشَّنَا",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 12, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 13, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "Mieux vaut un peu qui suffit qu’une abondance qui distrait.",
                  "arabic_text": "مَا قَلَّ وَكَفَى خَيْرٌ مِمَّا كَثُرَ وَأَلْهَى",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 13, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 14, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "Celui qui reprend son don est comme celui qui mange son vomi.",
                  "arabic_text": "الرَّاجِعُ فِيْ هِبَتِهِ کَالرَّاجِعِ فِيْ قَیْئِهِ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 14, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 15, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "L’affliction vient des paroles (inconséquentes).",
                  "arabic_text": "الْبَلَاءُ مُوَکِّلٌ بِالْمَنْطِقِ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 15, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 16, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "Les gens sont comme les dents d’un peigne.",
                  "arabic_text": "النَّاسُ کَأسْنَانِ الْمُشْطِ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 16, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 17, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "La richesse réside dans la richesse de l’âme.",
                  "arabic_text": "الْغِنَى غِنَى النَّفْسِ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 17, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 18, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "La personne heureuse tire des leçons des actions des autres.",
                  "arabic_text": "الْسَّعِیْدُ مَنْ وُّعِظَ بِغَیْرِهِ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 18, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 19, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "En effet, dans la poésie il y a de la sagesse et dans l’éloquence il y a de la magie.",
                  "arabic_text": "وَ إِنَّ مِنَ الشِّعْرِ لَحِکْمَةً وَاِنَّ مِنَ الْبَیَانِ لَسِحْرًا",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 19, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 20, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "Le pardon du roi préserve le royaume.",
                  "arabic_text": "عَفْوُ الْمُلُوْكِ إِبْقَاءٌ لِلْمُلْكِ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 20, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 21, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "Un homme sera avec celui qu'il aime.",
                  "arabic_text": "اَلْمَرْءُ مَعَ مَنْ أَحَبَّ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 21, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 22, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "Un homme qui connaît sa valeur ne sera pas ruiné.",
                  "arabic_text": "مَا هَلَكَ إمْرُؤٌ عَرَفَ قَدْرَهُ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 22, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 23, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "L'enfant appartient au lit et la lapidation est pour l'adultère.",
                  "arabic_text": "اَلْوَلَدُ لِلْفِرَاشِ وَ لِلْعَاهِرِ الْحَجَرُ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 23, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 24, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "La main supérieure est supérieure à la main inférieure.",
                  "arabic_text": "الْیَدُ الْعُلْیَا خَیْرٌ مِّنَ الْیَدِ السُّفْلَی",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 24, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 25, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "Celui qui ne remercie pas les gens ne remercie pas Allah.",
                  "arabic_text": "لَا شَکَرَ اللهَ مَنْ لَّا یَشْکُرُ النَّاسَ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 25, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 26, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "Votre amour pour quelque chose peut vous aveugler et vous rendre sourd.",
                  "arabic_text": "حُبُّكَ الشَّيْءَ یُعْمِيْ وَ یُصِمُّ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 26, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 27, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "Les cœurs sont prédisposés à aimer quelqu’un qui leur fait du bien et à détester quelqu’un qui leur fait du mal.",
                  "arabic_text": "جُبِلَتِ الْقُلُوبُ عَلی حُبَّ مَنْ اَحْسَنَ اِلَیْهَا وَ بُغْضِ مَنْ اَسَاءَ اِلَیْهَا",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 27, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 28, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "Celui qui se repent de son péché est comme quelqu’un qui n’a pas de péché.",
                  "arabic_text": "الْتَّائِبُ مِنَ الذَّنْبِ کَمَنْ لَا ذَنْبَ لَهُ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 28, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 29, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "Celui qui assiste réellement à un événement voit ce que celui qui est absent ne voit pas.",
                  "arabic_text": "الشَّاهِدُ یَرَی مَا لَا یَرَاهُ الْغَائِبُ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 29, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 30, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "Si le noble d'un peuple vient à toi, honore-le.",
                  "arabic_text": "اِذا جَاءَکُمْ کَرِیْمُ قَوْمٍ فَاَکْرِمُوهُ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 30, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 31, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "Les faux serments ravagent les foyers (terres).",
                  "arabic_text": "الْیَمِینُ الْفَاجِرَةُ تَدَعُ الدِّیَارَ الْبَلَاقِعَ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 31, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 32, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "Quiconque est tué en essayant de sauver ses biens est un martyr.",
                  "arabic_text": "مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِیْدٌ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 32, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 33, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "Les actions passent par les intentions.",
                  "arabic_text": "الْاَعْمَالُ بِالنِّیَّةِ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 33, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 34, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "Le chef d’un peuple est son serviteur.",
                  "arabic_text": "سَیِّدُ الْقَوْمِ خَادِمُهُمْ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 34, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 35, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "La meilleure des affaires est celle qui est équilibrée.",
                  "arabic_text": "خَیْرُ الْأُمُوْرِ أَوْسَطُهَا",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 35, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 36, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "Ô Allah, bénis ma nation lors de son lever matinal le jeudi !",
                  "arabic_text": "اَللَّهُمَّ بَارِكْ فِیْ أُمَّتِیْ فِی بُکُوْرِهَا یَوْمَ الْخَمِیْسِ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 36, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 37, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "La pauvreté peut presque se transformer en incrédulité.",
                  "arabic_text": "کَادَ الْفَقْرُ أَنْ یَکُوْنَ کُفْرًا",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 37, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 38, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "Voyager est une partie de la punition.",
                  "arabic_text": "الْسَّفَرُ قِطْعَةٌ مِّنَ الْعَذَابِ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 38, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 39, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "La meilleure des provisions est la Conscience de Dieu (taqwa).",
                  "arabic_text": "خَیْرُ زَّادِ الْتَّقْوَی",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 39, 40 Hadith Shah Waliullah"
                    }
                  ]
                },
                {
                  "reference": "Hadith 40, 40 Hadith Shah Waliullah",
                  "narrator": null,
                  "english_text": "Les réunions sont sous confiance.",
                  "arabic_text": "الْمَجَالِسُ بِالْاَمَانَةِ",
                  "references": [
                    {
                      "label": "Reference",
                      "value": ": Hadith 40, 40 Hadith Shah Waliullah"
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  }
}