{
  "indextag": "Le Hadith du Prophète Muhammad (صلى الله عليه و سلم) à portée de main",
  "Les 40 Hadiths d'An-Nawawi": {
    "english_name": "Les 40 Hadiths d'An-Nawawi",
    "arabic_name": "الأربعون النووية",
    "link": "https://sunnah.com/nawawi40",
    "books_or_chapters": {
      "about_info": {
          "about_title": "Les Sunan d'Ad-Darimi",
          "about_content_english": "La louange est [due] à Allah, Seigneur des mondes, Soutien des cieux et de la terre, Directeur de toutes les créatures, Envoyeur de messagers – qu’Allah répande Ses éloges et Sa paix sur eux tous – aux êtres responsables afin de les guider et de clarifier les voies de la religion par des preuves décisives et des arguments clairs. Je Le loue pour tous Ses bienfaits et Lui demande un surplus de Sa grâce et de Sa générosité. J’atteste qu’il n’y a de divinité qu’Allah, Lui seul, sans associé – l’Unique, le Tout-Puissant, le Généreux, le Pardonneur perpétuel. Et j’atteste que notre maître Muḥammad est Son serviteur et messager ; Son bien-aimé et Son ami pur ; la meilleure des créatures ; celui honoré par le noble Qur’ān, le miracle perpétuel à travers la succession des années ; et par des sunnahs qui éclairent ceux qui recherchent la juste guidance ; distingué par la concision dans l’éloquence et la facilité en religion. Que les bénédictions et la paix d’Allah soient sur lui, ainsi que sur tous les prophètes et messagers, leurs familles et tous les gens vertueux.\n\nEnsuite – il nous a été rapporté de Ali bin Abī Ṭālib, Abdullāh bin Mas‘ūd, Mu‘ādh bin Jabal, Abū d-Dardā’, Ibn Umar, Ibn ʽAbbās, Anas bin Mālik, Abū Hurayrah et Abū Sa‘īd al-Khudri (qu’Allah soit satisfait d’eux) par de nombreuses chaînes avec des variantes de narration que le Messager d’Allah (ﷺ) a dit : \"Quiconque préserve pour ma communauté quarante ḥadīths concernant sa religion – Allah le ressuscitera le Jour de la Résurrection parmi les juristes et les savants.\" Dans une narration, il est dit : \"...Allah le ressuscitera en tant que juriste et savant,\" et dans celle d’Abū d-Dardā’ : \"...Je serai pour lui, le Jour de la Résurrection, un intercesseur et un témoin.\" Dans la narration d’Ibn Mas‘ūd, il est dit : \"...il lui sera dit : 'Entre par n’importe quelle porte du Paradis que tu veux,'\" et dans celle d’Ibn Umar : \"...il sera inscrit parmi les savants et ressuscité parmi les martyrs.\" Mais les spécialistes du ḥadīth se sont accordés à dire qu’il s’agit d’un ḥadīth faible malgré ses nombreuses chaînes de transmission.\n\nLes savants ont compilé, dans ce contexte, d’innombrables recueils. Le premier que j’ai connu à l’avoir fait est Abdullāh bin al-Mubārak, puis Ibn Aslam at-Tūsi, le savant nourricier ; ensuite al-Ḥasan bin Sufyān an-Nasā’i, Abū Bakr al-Ajurri, Abū Bakr Muḥammad bin Ibrāheem al-Asfahāni, ad-Daraqutni, al-Ḥākim, Abū Nuaym, Abū Abdur-Raḥmān as-Sulami, Abū Sa‘īd al-Malīni, Abū ‘Uthmān as-Sabūni, Abdullāh bin Muḥammad al-Anṣāri, Abū Bakr al-Bayhaqi et d’innombrables autres, tant parmi les anciens que les plus récents. Et j’ai fait istikhārah à Allah, l’Exalté, concernant la compilation de quarante ḥadīths, suivant l’exemple de ces illustres imams et gardiens de l’Islam. En effet, les savants se sont accordés sur la permissibilité d’agir sur un ḥadīth faible en ce qui concerne les œuvres vertueuses. Mais en dépit de cela, mon appui ne repose pas sur ce ḥadīth, mais plutôt sur la parole authentique du Prophète (ﷺ) : \"Que celui qui est présent parmi vous transmette à celui qui est absent\" et sur sa parole : \"Qu’Allah illumine [le visage] d’une personne qui a entendu ma parole, l’a comprise et l’a transmise telle qu’il l’a entendue.\"\n\nToute personne aspirant à l’Au-delà doit connaître ces ḥadīths pour l’importance des informations qu’ils contiennent et parce qu’ils alertent sur toutes les formes d’obéissance [à Allah], ce qui est évident pour quiconque y réfléchit. C’est en Allah que je place ma confiance, à Lui je m’en remets et de Lui vient mon soutien. À Lui appartiennent la louange et la grâce, et c’est de Lui que proviennent la réussite et la préservation.",
          "about_content_arabic": "الحمد لله رب العالمين قيوم السموات والأرضين، مدبر الخلائق أجمعين، باعث الرسل - صلواته وسلامه عليهم - إلى المكلفين لهدايتهم وبيان شرائع الدين بالدلائل القطعية، وواضحات البراهين. أحمده على جميع نعمه وأسأله المزيد من فضله وكرمه. وأشهد أن لا إله إلا الله الواحد القهار، الكريم الغفار، وأشهد أن سيدنا محمداً عبده ورسوله، وحبيبه وخليله، أفضل المخلوقين، المكرم بالقرآن العزيز المعجزة المستمرة على تعاقب السنين، وبالسنن المستنيرة للمسترشدين، المخصوص بجوامع الكلم وسماحة الدين. صلوات الله وسلامه عليه وعلى سائر النبيين والمرسلين، وآل كل وسائر الصالحين.\n\nأما بعد: فقد روينا عن علي بن أبي طالب، وعبد الله بن مسعود، ومعاذ بن جبل، وأبي الدرداء، وابن عمر، وابن عباس، وأنس بن مالك، وأبي هريرة، وأبي سعيد الخدري رضي الله تعالى عنهم، من طرق كثيرات بروايات متنوعات، أن رسول الله صلى الله عليه وسلم قال: \"من حفظ على أمتي أربعين حديثًا من أمر دينها بعثه الله يوم القيامة في زمرة الفقهاء والعلماء\". وفي رواية: \"بعثه الله فقيهًا عالمًا\"، وفي رواية أبي الدرداء: \"وكنت له يوم القيامة شافعًا وشهيدًا\"، وفي رواية ابن مسعود: \"قيل له: ادخل من أي أبواب الجنة شئت\"، وفي رواية ابن عمر: \"كُتب في زمرة العلماء وحُشر في زمرة الشهداء\". واتفق الحفاظ على أنه حديث ضعيف وإن كثرت طرقه.\n\nوقد صنّف العلماء رضي الله تعالى عنهم في هذا الباب ما لا يُحصى من المصنّفات. فأول من علمته صنّف فيه: عبد الله بن المبارك، ثم محمد بن أسلم الطوسي العالم الرباني، ثم الحسن بن سفيان النسائي، وأبو بكر الآجري، وأبو بكر بن إبراهيم الأصفهاني، والدارقطني، والحاكم، وأبو نعيم، وأبو عبد الرحمن السلمي، وأبو سعيد الماليني، وأبو عثمان الصابوني، وعبد الله بن محمد الأنصاري، وأبو بكر البيهقي، وخلائق لا يُحصون من المتقدمين والمتأخرين. وقد استخرت الله تعالى في جمع أربعين حديثًا اقتداءً بهؤلاء الأئمة الأعلام وحفاظ الإسلام. وقد اتفق العلماء على جواز العمل بالحديث الضعيف في فضائل الأعمال، ومع هذا فليس اعتمادي على هذا الحديث، بل على قوله صلى الله عليه وسلم في الأحاديث الصحيحة: \"ليبلغ الشاهد منكم الغائب\"، وقوله صلى الله عليه وسلم: \"نضّر الله امرأً سمع مقالتي فوعاها فأدّاها كما سمعها\".\n\nثم من العلماء من جمع الأربعين في أصول الدين، وبعضهم في الفروع، وبعضهم في الجهاد، وبعضهم في الزهد، وبعضهم في الآداب، وبعضهم في الخطب، وكلها مقاصد صالحة رضي الله تعالى عن قاصديها. وقد رأيت جمع أربعين حديثًا أهم من هذا كله، وهي أربعون حديثًا مشتملة على جميع ذلك، وكل حديث منها قاعدة عظيمة من قواعد الدين، قد وصفه العلماء بأن مدار الإسلام عليه، أو هو نصف الإسلام، أو ثلثه، أو نحو ذلك. ثم ألتزم في هذه الأربعين أن تكون صحيحة، ومعظمها في صحيحي البخاري ومسلم، وأذكرها محذوفة الأسانيد، ليسهل حفظها، ويعم الانتفاع بها إن شاء الله تعالى، ثم أُتبعها بباب في ضبط خفي ألفاظها.\n\nوينبغي لكل راغب في الآخرة أن يعرف هذه الأحاديث، لما اشتملت عليه من المهمات، واحتوت عليه من التنبيه على جميع الطاعات، وذلك ظاهر لمن تدبّره. وعلى الله اعتمادي، وإليه تفويضي واستنادي، وله الحمد والنعمة، وبه التوفيق والعصمة."

      
      },
      "chapters_and_hadiths": [
        {
          "chapter_no": null,
          "chapter_title_english": "Hadiths orphelins",
          "chapter_title_arabic": null,
          "hadiths": [
            {
              "reference": "Hadith 1, 40 Hadith an-Nawawi",
              "narrator": "Il est rapporté d'après l'émir des Mouminins, Abu Hafs 'Umar bin al-Khattab (ra) qui a dit :",
              "english_text": "J'ai entendu le Messager d'Allah (ﷺ) dire : « Les actes sont jugés selon les motifs (niyyah), ainsi chacun aura ce qu'il a voulu. Ainsi, celui dont l'émigration (hijrah) est pour Allah et Son Messager, son émigration est pour Allah et Son Messager ; mais celui dont l'émigration est pour un bien de ce monde qu'il pourrait acquérir ou pour une femme qu'il pourrait épouser, son émigration est pour ce pour quoi il a émigré. »\n\n[Boukhari et Muslim]",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 1, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 2, 40 Hadith an-Nawawi",
              "narrator": "Également d'après 'Umar (ra) qui a dit :",
              "english_text": "Alors que nous étions assis un jour avec le Messager d'Allah (ﷺ), apparut devant nous un homme vêtu de vêtements blancs et aux cheveux très noirs. Il n'y avait aucune trace de voyage sur lui et aucun de nous ne le connaissait. \n\nIl s'assit près du Prophète (ﷺ), posa ses genoux contre les genoux du Prophète (ﷺ) et plaça ses mains sur ses cuisses, et dit : « Ô Muhammad ! Informe-moi de l'Islam. » Le Messager d'Allah (ﷺ) répondit : « L'Islam consiste à témoigner qu'il n'y a pas de divinité digne d'adoration en dehors d'Allah et que Muhammad est Son Messager (ﷺ), à accomplir la prière rituelle, à payer la zakat, à jeûner pendant le Ramadan et à accomplir le Hajj (pèlerinage) à la Maison (la Ka`ba à La Mecque), si vous pouvez trouver un chemin pour y arriver (ou trouver les moyens d'y parvenir). » Il dit : « Tu as dit la vérité. »\n\nNous fûmes étonnés qu'il l'interrogeât ainsi (ﷺ) et lui dît ensuite qu'il avait raison. Mais il continua : « Informe-moi de la foi. » Il (le Prophète) répondit : « C'est que tu croies en Allah, en Ses anges, en Ses Livres, en Ses messagers, au Jour dernier et au destin (qadar), dans ses bons comme dans ses mauvais côtés. » Il dit : « Tu as dit vrai. »\n\nIl (l'homme) dit alors : « Informe-moi de l'Ihsan. » Il (le Prophète) répondit : « C'est que tu adores Allah comme si tu Le voyais, car bien que tu ne Le voies pas, Lui te voit. »\n\nIl dit : « Informe-moi de l'Heure. » Il (le Prophète) dit : « Celui à qui on pose la question n'en sait pas plus que celui qui pose la question. » Alors il dit : « Informe-moi de ses signes. » Il dit : « Il y a des choses que l'esclave donnera naissance à sa maîtresse et que vous verrez les déchaussés, les nus, les démunis, les bergers de moutons (concurrencer les uns avec les autres) pour construire de hautes constructions. » L'homme s'en alla.\n\nJ'attendis un moment, puis il (le Prophète) dit : « Ô 'Umar, sais-tu qui était cet interrogateur ? » Je répondis : « Allah et Son Messager le savent mieux. » Il dit : « C'était Jibril. Il est venu vous enseigner votre religion. »\n\n[Muslim]",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 2, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 3, 40 Hadith an-Nawawi",
              "narrator": "D'après Abdullah, fils d'Omar ibn al-Khattab (ra), qui a dit :",
              "english_text": "J'ai entendu le Messager d'Allah (ﷺ) dire : « L'Islam est fondé sur cinq piliers : témoigner qu'il n'y a pas de divinité digne d'adoration en dehors d'Allah et que Muhammad est le Messager d'Allah, accomplir la prière, s'acquitter de la zakat (aumône obligatoire), accomplir le pèlerinage à la Maison et jeûner pendant le Ramadan. »\n\n[Bukhari & Muslim]",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 3, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 4, 40 Hadith an-Nawawi",
              "narrator": "D'après Abdullah ibn Masood (ra), qui a dit :",
              "english_text": "FrançaisLe Messager d'Allah (ﷺ), qui est le véridique, le croyant, nous a rapporté : « En vérité, chacun de vous est créé dans le ventre de sa mère pendant quarante jours sous la forme d'une goutte, puis il devient un caillot de sang pendant une période similaire, puis un morceau de chair pendant une période similaire, puis il lui est envoyé un ange qui lui insuffle son âme et qui reçoit quatre ordres : d'écrire sa subsistance, sa durée de vie, ses actions et s'il sera heureux ou malheureux (c'est-à-dire s'il entrera ou non au Paradis). \n\nPar Celui qu'il n'y a pas d'autre divinité que Lui, en vérité l'un de vous accomplit les actions des gens du Paradis jusqu'à ce qu'il n'y ait plus qu'une longueur de bras entre lui et le Paradis, et ce qui a été écrit le rattrape, alors il agit avec les actions des gens de l'Enfer et y entre ainsi ; et en vérité, l’un d’entre vous accomplit les actions des gens de l’Enfer, jusqu’à ce qu’il ne reste plus qu’une longueur de bras entre lui et l’Enfer, et ce qui a été écrit le rattrape, et il agit alors avec les actions des gens du Paradis et ainsi il y entre. »\n\n[Bukhari & Muslim]",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 4, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 5, 40 Hadith an-Nawawi",
              "narrator": "D'après la mère des croyants, Aïcha (ra), qui a dit :",
              "english_text": "Le Messager d’Allah (ﷺ) a dit : « Quiconque innove en cette matière (c’est-à-dire en Islam) en quoi que ce soit qui n’en fait pas partie, la verra rejetée (par Allah). »\n\n[Boukhari et Muslim]\nDans une autre version de Muslim, on peut lire : « Quiconque fait un acte que nous n’avons pas ordonné, la verra rejetée (par Allah). »",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 5, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 6, 40 Hadith an-Nawawi",
              "narrator": "D’après an-Nu’man ibn Basheer (ra), qui a dit :",
              "english_text": "J’ai entendu le Messager d’Allah (ﷺ) dire : « Ce qui est licite est clair et ce qui est illicite est clair. Entre les deux, il y a des choses douteuses que beaucoup de gens ignorent. Ainsi, celui qui évite les choses douteuses se rassure quant à sa religion et à son honneur, mais celui qui tombe dans les choses douteuses tombe dans l’illicite, comme le berger qui paît autour d’un sanctuaire, ne faisant que paître. En vérité, chaque roi a un sanctuaire, et le sanctuaire d’Allah, ce sont Ses interdits. En vérité, il y a dans le corps un morceau de chair qui, s’il est entier, tout le corps l’est, et s’il est malade, tout [le corps] l’est. En vérité, c’est le cœur. »\n\n[Boukhari & Muslim]",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 6, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 7, 40 Hadith an-Nawawi",
              "narrator": "D'après Tameem ibn Aus ad-Dari (ra) :",
              "english_text": "Le Prophète (ﷺ) a dit : « La religion est une recommandation. » Nous avons demandé : « À qui ? » Il (ﷺ) a dit : « À Allah, à Son Livre, à Son Messager, aux chefs des musulmans et à leur peuple. »\n\n[Muslim]",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 7, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 8, 40 Hadith an-Nawawi",
              "narrator": "D'après Abdullah ibn Umar (ra) :",
              "english_text": "Le Messager d'Allah (ﷺ) a dit : « J'ai reçu l'ordre de combattre les gens jusqu'à ce qu'ils attestent qu'il n'y a pas d'autre divinité digne d'adoration qu'Allah et que Muhammad est le Messager d'Allah, qu'ils accomplissent la prière et s'acquittent de la zakat. S'ils le font, ils seront alors protégés par moi pour leurs vies et leurs biens, à moins qu'ils ne commettent des actes punissables en Islam. Et leur compte sera à Allah. »\n\n[Boukhari & Muslim]",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 8, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 9, 40 Hadith an-Nawawi",
              "narrator": "D'après Abou Hourayra (ra) :",
              "english_text": "J'ai entendu le Messager d'Allah (ﷺ) dire : « Ce que je vous ai interdit, évitez-le. Ce que je vous ai ordonné, faites-le autant que vous le pouvez. En vérité, ce ne sont que leurs interrogations excessives et leurs désaccords avec leurs prophètes qui ont détruit [les nations] qui étaient avant vous. »\n\n[Boukhari et Muslim]",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 9, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 10, 40 Hadith an-Nawawi",
              "narrator": "D'après Abou Hourayra (ra) :",
              "english_text": "Le Messager d’Allah (ﷺ) a dit : « Allah, le Tout-Puissant, est bon et n’accepte que ce qui est bon. Et Allah a en vérité ordonné aux croyants de faire ce qu’Il ​​a ordonné aux Messagers. \n\nAlors le Tout-Puissant a dit : « Ô Messagers ! Mangez des aliments licites et accomplissez de bonnes œuvres. » [23:51] Et le Tout-Puissant a dit : « Ô vous qui croyez ! Mangez des aliments licites que Nous vous avons attribués. » [2:172] »\n\nPuis il a mentionné [le cas] d’un homme qui, après avoir voyagé loin, est échevelé et couvert de poussière, et qui étend ses mains vers le ciel en disant : « Ô Seigneur ! Ô Seigneur ! », alors que sa nourriture est haram (illicite), sa boisson est haram, son vêtement est haram et il a été nourri de haram. Comment alors [sa supplication] peut-elle être exaucée ? \n\n[Musulman]",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 10, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 11, 40 Hadith an-Nawawi",
              "narrator": "D'après Abou Muhammad al-Hasan ibn Ali ibn Abi Talib (qu'Allah l'agrée), le petit-fils du Messager d'Allah (bénédiction et salut soient sur lui) et celui qu'il aimait le plus, qui a dit :",
              "english_text": "J'ai mémorisé le hadith du Messager d'Allah (sur lui la paix et le salut) : « Laissez ce qui vous fait douter pour ce qui ne vous fait pas douter. »\n\n[At-Tirmidhi]\n[An-Nasai]\nAt-Tirmidhi a dit que c'était un hadith bon et authentique (hasan sahih).",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 11, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 12, 40 Hadith an-Nawawi",
              "narrator": "D'après Abou Hourayra (qu'Allah l'agrée) qui a dit :",
              "english_text": "Le Messager d’Allah (sur lui la paix et le salut) a dit : « La perfection de l’Islam consiste en partie à abandonner ce qui ne le concerne pas. »\n\nUn hadith hasan (bon) qui a été rapporté de cette façon par at-Tirmidhi et d’autres.",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 12, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 13, 40 Hadith an-Nawawi",
              "narrator": "D'après Abou Hamzah Anas ibn Malik (qu'Allah l'agrée), serviteur du Messager d'Allah (sur lui la paix et le salut), le Prophète (sur lui la paix et le salut) a dit :",
              "english_text": "Aucun d'entre vous ne croit [vraiment] tant qu'il n'aime pas pour son frère ce qu'il aime pour lui-même. \n\n[Al-Bukhari]\n[Muslim]",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 13, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 14, 40 Hadith an-Nawawi",
              "narrator": "D'après Ibn Masood (qu'Allah l'agrée) qui a dit :",
              "english_text": "Le Messager d’Allah (sur lui la paix et le salut) a dit : « Il n’est pas permis de verser le sang d’un musulman sauf dans trois cas : celui d’un homme marié qui commet l’adultère, celui d’une vie pour une vie et celui qui abandonne sa religion et se sépare de la communauté. »\n\n[Al-Bukhari]\n[Muslim]",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 14, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 15, 40 Hadith an-Nawawi",
              "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), le Messager d'Allah (sur lui la paix et le salut) a dit :",
              "english_text": "Que celui qui croit en Allah et au Jour dernier dise du bien ou se taise ; que celui qui croit en Allah et au Jour dernier soit généreux envers son prochain ; et que celui qui croit en Allah et au Jour dernier soit généreux envers son invité.\n\n[Al-Bukhari]\n[Muslim]",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 15, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 16, 40 Hadith an-Nawawi",
              "narrator": "D'après Abou Hourayra (qu'Allah l'agrée) :",
              "english_text": "Un homme dit au Prophète (sur lui la paix et le salut) : « Donne-moi un conseil », ce à quoi il répondit : « Ne te mets pas en colère ». L’homme répéta plusieurs fois sa demande de conseil et il répondit à chaque fois : « Ne te mets pas en colère ».\n\n[Al-Bukhari]",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 16, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 17, 40 Hadith an-Nawawi",
              "narrator": "D’après Abou Ya’la Shaddad ibn Aws (qu’Allah l’agrée), le Messager d’Allah (sur lui la paix et le salut) a dit :",
              "english_text": "En vérité, Allah a prescrit la perfection en toute chose. Si vous tuez, tuez bien ; et si vous égorgez, égorgez bien. Que chacun de vous aiguise sa lame et qu'il épargne la souffrance à l'animal qu'il égorge. »\n\n[Muslim]",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 17, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 18, 40 Hadith an-Nawawi",
              "narrator": "D'après Abou Dharr Jundub ibn Junadah et Abou Abdur-Rahman Muadh bin Jabal (qu'Allah l'agrée), le Messager d'Allah (bénédiction et salut soient sur lui) a dit :",
              "english_text": "Ayez la crainte d'Allah où que vous soyez, faites suivre chaque mauvaise action d'une bonne action qui l'effacera, et comportez-vous bien envers les gens.\n\nAt-Tirmidhi a rapporté ce hadith comme étant un bon hadith, et certaines versions le considèrent comme un hadith authentique et bon.",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 18, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 19, 40 Hadith an-Nawawi",
              "narrator": "D'après Abu Abbas Abdullah bin Abbas (qu'Allah l'agrée) qui a dit :",
              "english_text": "Un jour, j’étais derrière le Prophète (sur lui la même monture) et il me dit : « Ô jeune homme, je vais t’enseigner quelques paroles [de conseil] : Sois attentif à Allah et Allah te protégera. Sois attentif à Allah et tu Le trouveras devant toi. Si tu demandes, alors demande à Allah [seul] ; et si tu cherches de l’aide, alors cherche de l’aide auprès d’Allah [seul]. Et sache que si la communauté se rassemble pour te faire du bien, elle ne te fera du bien que dans la mesure où Allah t’a déjà prescrit. Et si elle se rassemble pour te faire du mal, elle ne te fera du mal que dans la mesure où Allah t’a déjà prescrit. Les plumes sont levées et les pages sont sèches. »\n\nCe hadith a été rapporté par at-Tirmidhi, qui a dit qu’il s’agissait d’un bon et vrai hadith. Une autre narration, autre que celle de Tirmidhi, dit :\n\nSoyez attentif à Allah et vous Le trouverez devant vous. Reconnaissez Allah dans l'aisance et dans la prospérité, et Il se souviendra de vous dans l'adversité. Et sachez que ce qui vous a échappé ne vous échappera pas, et que ce qui vous a atteint ne vous échappera pas. Et sachez que la victoire vient avec la patience, le soulagement avec l'affliction, et la difficulté avec l'aisance.",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 19, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 20, 40 Hadith an-Nawawi",
              "narrator": "D’après Abu Masood Uqbah bin ’Amr al-Ansari al-Badrî (qu’Allah l’agrée) qui a dit :",
              "english_text": "Le Messager d’Allah (sur lui la paix et le salut) a dit : « En vérité, ce que les gens ont appris de la première prophétie est : Si vous n’éprouvez aucune honte, faites ce que vous voulez. »\n\n[Al-Bukhari]",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 20, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 21, 40 Hadith an-Nawawi",
              "narrator": "D'après Abu `Amr — également appelé Abu `Amrah — Sufyan bin Abdullah ath- Thaqafee (qu'Allah l'agrée) qui a dit :",
              "english_text": "Je dis : « Ô Messager d'Allah, dis-moi quelque chose sur l'Islam que je ne puisse demander à personne d'autre que toi. » Il (que la paix et les bénédictions d'Allah soient sur lui) dit : « Dis-moi que tu crois en Allah, et ensuite sois ferme. »\n\n[Muslim]",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 21, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 22, 40 Hadith an-Nawawi",
              "narrator": "D'après Abu Abdullah Jabir bin Abdullah al-Ansari (qu'Allah l'agrée) :",
              "english_text": "Un homme a interrogé le Messager d’Allah (sur lui la paix et le salut) et lui a dit : « Penses-tu que si j’accomplissais les prières obligatoires, je jeûnais le Ramadan, considérais comme licite ce qui est licite et interdisais ce qui est illicite, et n’augmentais pas ces actes [en actes surérogatoires], j’entrerais au Paradis ? » Il (sur lui la paix et le salut) a répondu : « Oui. »\n\n[Muslim]",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 22, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 23, 40 Hadith an-Nawawi",
              "narrator": "D'après Abou Malik al-Harith ibn Asim al-Asharei (qu'Allah l'agrée) qui a dit :",
              "english_text": "Le Messager d’Allah (sur lui la paix et le salut) a dit : « La pureté est la moitié de la foi. La louange à Allah remplit la balance, et la louange à Allah et la prière remplissent ce qui est entre le ciel et la terre. La prière est une lumière, l’aumône une preuve, la patience une illumination, et le Coran une preuve pour vous ou contre vous. Chaque personne commence sa journée en vendant son âme, soit en la libérant, soit en la détruisant. »\n\n[Muslim]",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 23, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 24, 40 Hadith an-Nawawi",
              "narrator": "D'après Abou Dharr al-Ghifarî (qu'Allah l'agrée), le Prophète (bénédiction et salut soient sur lui) a dit, d'après son Seigneur :",
              "english_text": "Ô Mes serviteurs ! Je me suis interdit l'oppression (dhulm) et je l'ai interdite entre vous. Ne vous opprimez donc pas les uns les autres.\n\nÔ Mes serviteurs, vous êtes tous dans l'égarement, sauf ceux que J'ai guidés. Cherchez donc auprès de Moi un guide et Je vous guiderai.\n\nÔ Mes serviteurs, vous avez tous faim, sauf ceux que J'ai nourris. Cherchez donc auprès de Moi un aliment et Je vous nourrirai.\n\nÔ Mes serviteurs, vous êtes tous nus, sauf ceux que J'ai habillés. Cherchez donc auprès de Moi un vêtement et Je vous habillerai.\n\nÔ Mes serviteurs, vous commettez des péchés jour et nuit, et Je pardonne tous les péchés. Cherchez donc auprès de Moi un pardon et Je vous pardonnerai.\n\nÔ Mes serviteurs, vous ne parviendrez pas à Me nuire pour Me nuire, et vous ne parviendrez pas à Me faire du bien pour Me faire du bien.\n\nÔ Mes serviteurs, si le premier d'entre vous et le dernier d'entre vous, les humains et les djinns parmi vous, étaient tous aussi pieux que le cœur le plus pieux de n'importe lequel d'entre vous, alors cela n'augmenterait pas d'un iota Mon Royaume.\n\nÔ Mes serviteurs, si le premier d'entre vous et le dernier d'entre vous, les humains et les djinns parmi vous, étaient tous aussi méchants que le cœur le plus méchant de n'importe lequel d'entre vous, alors cela ne diminuerait pas d'un iota Mon Royaume.\n\nÔ Mes serviteurs, si le premier d'entre vous et le dernier d'entre vous, les humains et les djinns parmi vous, se réunissaient tous en un seul endroit et Me demandaient, et que Je donnais à chacun ce qu'il demandait, alors cela ne diminuerait pas ce que Je Possède, sauf ce que diminue l'océan quand une aiguille y est plongée.\n\nÔ Mes serviteurs, ce ne sont que vos actes dont Je vous rends compte, et pour lesquels Je vous rétribue. Ainsi, celui qui trouve le bien, qu'il loue Allah, et celui qui trouve autre chose, qu'il ne s'en prenne qu'à lui-même.\n\n[Muslim]",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 24, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 25, 40 Hadith an-Nawawi",
              "narrator": "D'après Abou Dharr (qu'Allah l'agrée) :",
              "english_text": "Certains parmi les Compagnons du Messager d'Allah (sur lui la paix et le salut) ont dit au Prophète (sur lui la paix et le salut) : « Ô Messager d'Allah, les riches s'en sont emparés ; ils prient comme nous prions, ils jeûnent comme nous jeûnons et ils font [beaucoup] de charité en vertu de leur richesse. » Il (sur lui la paix et le salut) dit : « Allah n'a-t-il pas créé pour vous des choses à donner en aumône ? En vérité, toute tasbihah [dire : « subhan-Allah »] est une aumône, et toute takbirah [dire : « Allahu akbar »] est une aumône, et toute tahmidah [dire : « al-hamdu lillah »] est une aumône, et toute tahliélah [dire : « laa ilaha illAllah »] est une aumône. Ordonner le bien est une aumône, et interdire le mal est une aumône. Et dans le boud`i [acte sexuel] de chacun de vous il y a une aumône. »\n\nIls dirent : « Ô Messager d'Allah, quand l'un de nous satisfait son désir charnel, aura-t-il une récompense pour cela ? » Il (sur lui la paix et le salut) dit : « Ne vois-tu pas que s'il agissait de façon illicite, il mériterait un châtiment ? De même, s'il agissait de façon licite, il mériterait une récompense. »\n\n[Muslim]",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 25, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 26, 40 Hadith an-Nawawi",
              "narrator": "D'après Abou Hourayra (qu'Allah l'agrée) qui a dit :",
              "english_text": "Le Messager d’Allah (sur lui la paix et le salut) a dit : « Chaque articulation de l’homme doit faire une aumône chaque jour au lever du soleil. Juger équitablement entre deux personnes est une aumône. Aider un homme à monter sur sa monture, le faire monter dessus ou y hisser ses affaires est une aumône. La bonne parole est une aumône. Chaque pas que vous faites vers la prière est une aumône. De même, enlever un objet nuisible du chemin est une aumône. »\n\n[Al-Bukhari]\n[Muslim]",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 26, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 27, 40 Hadith an-Nawawi",
              "narrator": "D’après an-Nawas ibn Sam’an (qu’Allah l’agrée), le Prophète (sur lui la paix et le salut) a dit :",
              "english_text": "FrançaisLa piété est une bonne conduite, et le mal est ce qui vacille dans ton âme et dont tu n’aimes pas que les gens apprennent l’existence.\n\n[Muslim]\nEt d’après Wabisah ibn Ma’bad (qu’Allah l’agrée) qui a dit :\n\nJe suis allé voir le Messager d’Allah (sur lui la paix et le salut) et il (sur lui la paix et le salut) m’a dit : « Tu es venu pour m’interroger sur la piété. » J’ai dit : « Oui. » Il (sur lui la paix et le salut) a dit : « Consulte ton cœur. La piété est ce qui apaise l’âme et apaise le cœur. Et le mal est ce qui vacille dans l’âme et cause un malaise dans la poitrine, même si les gens ont donné à plusieurs reprises leur avis juridique [en sa faveur]. »\nUn bon hadith transmis par les musnads des deux imams, Ahmed ibn Hambal et Ad-Darimi, avec une bonne chaîne d’autorité.",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 27, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 28, 40 Hadith an-Nawawi",
              "narrator": "D’après Abu Najeeh al-’Irbaad ibn Saariyah (qu’Allah l’agrée) qui a dit :",
              "english_text": "Le Messager d’Allah (sur lui la paix et le salut) nous a fait un sermon qui a rempli nos cœurs de crainte et nous a fait verser des larmes. Nous avons donc dit : « Ô Messager d’Allah ! C’est comme un sermon d’adieu, alors conseille-nous. » Il a dit : « Je vous conseille d’avoir la piété (taqwa) envers Allah, d’écouter et d’obéir [à votre chef], même si un esclave devenait votre amir. En vérité, celui d’entre vous qui vivra longtemps verra une grande controverse. Vous devez donc vous en tenir à ma Sunnah et à la Sunnah des Califes bien guidés, ceux qui guident sur le droit chemin. Tenez-vous-y obstinément [littéralement : avec vos molaires]. Méfiez-vous des choses nouvellement inventées [dans la religion], car en vérité, toute bidah (innovation) est un égarement. » [Abu Dawud]\nAt-Tirmidhi a rapporté que c'était un bon et vrai hadith.",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 28, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 29, 40 Hadith an-Nawawi",
              "narrator": "D'après Muadh ibn Jabal (qu'Allah l'agrée) qui a dit :",
              "english_text": "Je dis : « Ô Messager d’Allah, informe-moi d’un acte qui me fera entrer au Paradis et m’éloignera de l’Enfer. » Il (sur lui la paix et le salut) dit : « Tu m’as interrogé sur une grande affaire, mais elle est facile à celui à qui Allah la facilite : adorer Allah sans Lui associer aucun associé, accomplir la Salat, acquitter la Zakat, jeûner le Ramadan et faire le Pèlerinage à la Maison. »\n\nAlors il (sur lui la paix et le salut) dit : « Ne vais-je pas te guider vers les moyens du bien ? Le jeûne est un bouclier, l’aumône efface les péchés comme l’eau éteint le feu, et la prière d’un homme au plus profond de la nuit. » Puis il (sur lui la paix et le salut) récita : « [Ceux] qui abandonnent leur lit pour invoquer leur Seigneur par crainte et espoir, et qui dépensent (l’aumône dans le sentier d’Allah) de ce que Nous leur avons accordé. Personne ne sait ce qui leur est caché comme joie en récompense de ce qu’ils faisaient. » [as-Sajdah, 16-17]\n\nAlors il (que la paix et le salut d’Allah soient sur lui) dit : « Ne dois-je pas t’informer de la tête de l’affaire, de son pilier et de son sommet ? » J’ai dit : « Oui, ô Messager d’Allah. » Il (que la paix et le salut d’Allah soient sur lui) dit : « La tête de l’affaire est l’Islam, son pilier est la prière et son sommet est le jihad. » Puis il (que la paix et le salut d’Allah soient sur lui) dit : « Ne dois-je pas t’informer du fondement de tout cela ? » J’ai dit : « Oui, ô Messager d’Allah. » Alors il prit sa langue et dit : « Arrête cela. »\n\nJ’ai dit : « Ô Prophète d’Allah, allons-nous rendre des comptes pour ce que nous disons à ce sujet ? » Il (que la paix et le salut d’Allah soient sur lui) dit : « Que ta mère soit privée de toi, ô Muadh ! Y a-t-il quelque chose qui jette les gens dans le feu de l’Enfer sur leur visage – ou : sur leur nez – sinon les récoltes de leurs langues ? »\n\nCe hadith a été rapporté par at-Tirmidhi, qui a dit qu’il s’agissait d’un bon et vrai hadith.",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 29, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 30, 40 Hadith an-Nawawi",
              "narrator": "D’après Abou Tha’labah al-Kouchani — Jurthoom bin Nashir (qu’Allah l’agrée) — le Messager d’Allah (sur lui la paix et le salut) a dit :",
              "english_text": "Allah ta’ala a établi des obligations religieuses (fara’id), ne les négligez donc pas ; Il a fixé des limites, ne les transgressez donc pas ; Il a interdit certaines choses, ne les transgressez donc pas ; Il a gardé le silence sur certaines choses, par compassion pour vous et non par oubli ; ne les recherchez donc pas.\n\nUn hadith hasan rapporté par ad-Daraqutnee et d’autres.",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 30, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 31, 40 Hadith an-Nawawi",
              "narrator": "D’après Abu al-’Abbas Sahl bin Sa’ad as-Sa’idee (qu’Allah l’agrée) qui a dit :",
              "english_text": "Un homme vint trouver le Prophète (sur lui la paix et le salut) et lui dit : « Ô Messager d’Allah, ordonne-moi de faire un acte qui, si je le fais, fera que Dieu m’aime et que les gens m’aiment. » Il dit alors : « Renoncez au monde et Dieu vous aimera, et renoncez à ce que les gens possèdent et les gens vous aimeront. »\n\nUn hadith très bon rapporté par Ibn Majah et d’autres avec de bonnes sources.",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 31, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 32, 40 Hadith an-Nawawi",
              "narrator": "D’après Abou Sa’id al-Khudri (qu’Allah l’agrée), le Messager d’Allah (sur lui la paix et le salut) a dit :",
              "english_text": "Il ne doit y avoir ni préjudice (darar) ni préjudice réciproque (dirar).\n\nUn hadith hasan rapporté par Ibn Majah, ad-Daraqutnee et d'autres comme un hadith musnad. Il a également été rapporté par Malik dans al-Muwatta sous forme mursal d'après Amr bin Yahya, d'après son père d'après le Prophète (paix et bénédictions d'Allah sur lui), mais en laissant Abu Sa'eed de la chaîne. Et il y a d'autres chaînes de narrations qui se renforcent mutuellement.",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 32, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 33, 40 Hadith an-Nawawi",
              "narrator": "D'après Ibn Abbas (qu'Allah l'agrée), le Messager d'Allah (sur lui la paix et le salut) a dit :",
              "english_text": "Si l'on accordait aux gens tout ce qu'ils prétendent, les hommes s'approprieraient les biens et les vies des autres. Mais la charge de la preuve incombe à celui qui prétend, et le serment incombe à celui qui nie.\n\nUn hadith très bon rapporté par al-Baihaqee et d'autres sous cette forme, et une partie de celui-ci se trouve dans les deux Sahih.",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 33, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 34, 40 Hadith an-Nawawi",
              "narrator": "D'après Abou Sa'id al-Khudree (qu'Allah l'agrée) qui a dit :",
              "english_text": "J'ai entendu le Messager d'Allah (ﷺ) dire : « Quiconque d'entre vous voit un mal, qu'il le change avec sa main ; et s'il n'en est pas capable, qu'il le change avec sa langue ; et s'il n'en est pas capable, qu'il le change avec son cœur – et c'est là la plus faible des croyances. »\n\n[Muslim]",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 34, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 35, 40 Hadith an-Nawawi",
              "narrator": "D'après Abou Hourayra (qu'Allah l'agrée) qui a dit :",
              "english_text": "Le Messager d’Allah (sur lui la paix et le salut) a dit : « Ne vous enviez pas les uns les autres, ne vous gonflez pas les prix les uns les autres, ne vous haïssez pas les uns les autres, ne vous détournez pas les uns des autres et ne vous rabaissez pas dans vos échanges commerciaux. Soyez plutôt esclaves d’Allah et frères. Le musulman est le frère d’un musulman : il ne l’opprime pas, ne le trahit pas, ne lui ment pas et ne le méprise pas. La piété est là [et il a montré sa poitrine trois fois]. Il est déjà assez mal pour un homme de mépriser son frère musulman. Tout le musulman est inviolable pour un autre musulman : son sang, ses biens et son honneur. »\n\n[Muslim]",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 35, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 36, 40 Hadith an-Nawawi",
              "narrator": "D'après Abou Hourayra (qu'Allah l'agrée), le Prophète (sur lui la paix et le salut) a dit :",
              "english_text": "Quiconque éloigne d'un croyant une souffrance présente, Allah lui éloignera une souffrance du Jour de la Résurrection. Et quiconque allège le besoin d'un nécessiteux, Allah l'allègera dans ce monde et dans l'au-delà. Quiconque cache les méfaits d'un musulman, Allah le protégera dans ce monde et dans l'au-delà. Et Allah assistera Son serviteur aussi longtemps qu'il assistera son frère. Et quiconque suit un chemin pour y chercher la science, Allah lui facilitera le chemin du Paradis. Il n'y a pas de gens qui se rassemblent dans l'une des Maisons d'Allah, lisant le Livre d'Allah et l'étudiant entre eux, sans que la quiétude ne descende sur eux, que la miséricorde ne les enveloppe, que les anges ne les entourent et qu'Allah ne les mentionne parmi ceux qui sont avec Lui. Et quiconque est retardé par ses actions, ne sera pas hâté par sa lignée. \n\nRapporté par [Muslim] dans ces paroles.",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 36, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 37, 40 Hadith an-Nawawi",
              "narrator": "D'après Ibn Abbas (qu'Allah l'agrée), le Messager d'Allah (sur lui la paix et le salut) a rapporté d'après son Seigneur :",
              "english_text": "Allah ta’ala a écrit les bonnes actions et les mauvaises actions, et l’a expliqué ensuite [en disant] : « Quiconque a eu l’intention d’accomplir une bonne action, mais ne l’a pas accomplie, alors Allah l’inscrit auprès de Lui comme une bonne action complète. Et s’il a eu l’intention de l’accomplir et l’a accomplie, alors Allah l’inscrit auprès de Lui comme une bonne action complète allant de dix bonnes actions jusqu’à sept cents fois, jusqu’à plusieurs fois multipliées. Et s’il a eu l’intention d’accomplir une mauvaise action, mais ne l’a pas accomplie, alors Allah l’inscrit auprès de Lui comme une bonne action complète. Et s’il a eu l’intention de l’accomplir [c’est-à-dire la mauvaise action] et l’a accomplie, alors Allah l’inscrit comme une seule mauvaise action. »\n\n[Al-Bukhari]\n[Muslim].",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 37, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 38, 40 Hadith an-Nawawi",
              "narrator": "D'après Abou Hourayra (qu'Allah l'agrée) qui a dit :",
              "english_text": "Le Messager d’Allah (sur lui la paix et le salut) a dit : « En vérité, Allah ta’ala a dit : « Quiconque se montre hostile à l’un de Mes amis, alors Je lui déclare la guerre. Et Mon serviteur ne se rapproche de Moi que par les devoirs religieux que Je lui ai imposés. Et Mon serviteur continue de se rapprocher de Moi par des actes surérogatoires jusqu’à ce que Je l’aime. Quand Je l’aime, Je suis son ouïe avec laquelle il entend, sa vue avec laquelle il voit, sa main avec laquelle il frappe et son pied avec lequel il marche. S’il Me demandait quelque chose, Je le lui donnerais certainement ; et s’il cherchait refuge auprès de Moi, Je lui accorderais certainement refuge. »\n\n[Al-Bukhari]",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 38, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 39, 40 Hadith an-Nawawi",
              "narrator": "D'après Ibn Abbas (qu'Allah l'agrée), le Messager d'Allah (sur lui la paix et le salut) a dit :",
              "english_text": "En vérité, Allah m'a pardonné, à moi et à ma communauté, leurs erreurs, leurs oublis et ce qu'ils ont été contraints de faire sous la contrainte.\n\nHadîth hassan rapporté par Ibn Majah, al-Bayhaqî et d'autres.",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 39, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 40, 40 Hadith an-Nawawi",
              "narrator": "D'après Abdullah ibn Omar (qu'Allah l'agrée) qui a dit :",
              "english_text": "Le Messager d’Allah (sur lui la paix et le salut) m’a pris par l’épaule et m’a dit : « Sois dans ce monde comme si tu étais un étranger ou un voyageur. » \n\nEt Ibn Omar (qu’Allah l’agrée) disait : « Le soir, ne t’attends pas à vivre jusqu’au matin, et le matin, ne t’attends pas à vivre jusqu’au soir. Profite de ta santé avant les périodes de maladie, et profite de ta vie avant de mourir. » \n\n[Al-Bukhari]",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 40, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 41, 40 Hadith an-Nawawi",
              "narrator": "D’après Abu Muhammad Abdullah bin ’Amr bin al-’Aas (qu’Allah l’agrée) qui a dit :",
              "english_text": "Le Messager d’Allah (sur lui la paix et le salut) a dit : « Aucun d’entre vous ne croit vraiment tant que ses désirs ne sont pas soumis à ce que j’ai apporté. »\n\n[L’Imam an-Nawawi dit :] Nous l’avons rapporté dans Kitab al-Hujjah par une chaîne de narrateurs authentiques.",
              "arabic_text": "عَنْ أَبِي مُحَمَّدٍ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ رَضِيَ اللَّهُ عَنْهُمَا، قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم \"لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يَكُونَ هَوَاهُ تَبَعًا لِمَا جِئْتُ بِهِ\". \nحَدِيثٌ حَسَنٌ صَحِيحٌ، رَوَيْنَاهُ فِي كِتَابِ \"الْحُجَّةِ\" بِإِسْنَادٍ صَحِيحٍ.",
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 41, 40 Hadith an-Nawawi"
                }
              ]
            },
            {
              "reference": "Hadith 42, 40 Hadith an-Nawawi",
              "narrator": "D'après Anas (qu'Allah l'agrée) qui a dit :",
              "english_text": "J’ai entendu le Messager d’Allah (sur lui la paix et le salut) dire : « Allah, le Tout-Puissant, a dit : « Ô fils d’Adam, aussi longtemps que tu M’invoqueras et Me demanderas pardon, Je te pardonnerai ce que tu as fait, et Je ne m’en soucierai pas. Ô fils d’Adam, si tes péchés atteignaient les nuages ​​du ciel et que tu Me demandais pardon, Je te pardonnerais. Ô fils d’Adam, si tu venais à Moi avec des péchés presque aussi grands que la Terre, et si tu te présentais alors à Moi sans M’attribuer aucun associé, Je t’accorderais un pardon presque aussi grand. » \n\nCe hadith a été rapporté par at-Tirmidhi, qui a dit que c’était un hadith bon.",
              "arabic_text": null,
              "references": [
                {
                  "label": "Reference",
                  "value": ": Hadith 42, 40 Hadith an-Nawawi"
                }
              ]
            }
          ]
        }
      ]
    }
  }
}